    /*******************************************************************************
 深圳市汇川技术有限公司 版权所有（C）All rights reserved.                    
 文件名:    FUNC_MotorPara.c  
 创建人：   XXXXXX                 创建日期：XXXX.XX.XX                     
 修改人：   XXXXXX                 修改日期：XXXX.XX.XX 
 描述： 
    1.
    2.
 修改记录：  
    XXXX.XX.XX  XXXXXXX
    1.      
    2.     
********************************************************************************/ 

/* Includes ------------------------------------------------------------------*/
/* 引用头文件 */ 
#include "FUNC_GlobalVariable.h"
#include "FUNC_MotorPara.h"
#include "FUNC_FunCode.h"
#include "FUNC_OperEeprom.h"
#include "FUNC_ErrorCode.h"

/* Private_Constants ---------------------------------------------------------*/
/* 不带参数的宏定义 */
#define MOTOR_NUMS_SIT_H1AV           11         //汇川H1电机型号数量
#define MOTOR_NUMS_SIT_H2SV           10         //汇川H2电机型号数量---增加ISMH2-40C30CD-U231Y 备注：ISMV2-40C30CB-U231Y  要求220V，最大3000rpm。
#define MOTOR_NUMS_SIT_H3SV           15        //汇川H3电机型号数量
#define MOTOR_NUMS_SIT_H4SV           4         //汇川H4电机型号数量
#define MOTOR_NUMS_SIT_H3ZSV          4         //汇川H3-Z电机型号数量

#define MOTOR_NUMS_SIT_V1SV           5         //汇川V1电机型号数量
#define MOTOR_NUMS_SIT_V2SV           7         //汇川V2电机型号数量
#define MOTOR_NUMS_SIT_V3SV           9         //汇川V3电机型号数量 

//支持汇川电机型号总的数量 
#define SIT_MotorModelNum       ( MOTOR_NUMS_SIT_H1AV + MOTOR_NUMS_SIT_H2SV + MOTOR_NUMS_SIT_H3SV +MOTOR_NUMS_SIT_H4SV + \
                                  MOTOR_NUMS_SIT_H3ZSV+MOTOR_NUMS_SIT_V1SV + MOTOR_NUMS_SIT_V2SV + MOTOR_NUMS_SIT_V3SV)


#define MOTOR_NUMS_SANYO_P5           3         //SANYO_P5电机种类
#define MOTOR_NUMS_SANYO_P3           2         //SANYO_P3电机种类
#define MOTOR_NUMS_MECAPION_0         2         //MECAPION电机种类
#define MOTOR_NUMS_GOLDENAGE_0        1         //GOLDENAGE电机种类
#define MOTOR_NUMS_LINEAR             1         //直线电机种类

/* Private_Macros ------------------------------------------------------------*/
/* 带参数的宏定义 */

/* Private_TypesDefinitions --------------------------------------------------*/ 
/* 结构体变量定义 枚举变量定义 */
const STR_BLMOT_PARAM Motor_Parameter_Linear[MOTOR_NUMS_LINEAR] = 
{
		        13000,   /*H00_01 电机型号   13000             */
		            0,   /*H00_09 电机电压  0-220V                   */
		           39,   /*H00_10 额定功率   W                     */
		          230,   /*H00_11 连续电流   0.01a                    */
		         3750,   /*H00_12 连续推力  0.01nm                    */
		          690,   /*H00_13 最大电流  0.01a                    */
		         1900,   /*H00_14 额定速度   mm/s                    */
		         1900,   /*H00_15 最大速度   mm/s                      */
		          290,   /*H00_16 动子质量    g                    */
		            1,   /*H00_17 电机极对数                     */
		         3650,   /*H00_18 定子电阻   0.001Oh                    */
		          100,   /*H00_19 定子电感  Lq 0.01mH                    */
		          100,   /*H00_20 定子电感  Ld 0.01mH                    */
		         6700,   /*H00_21 反电势系数 mV/m/s               */
		         1650,   /*H00_22 推力常数   0.01N/A               */
		           25,   /*H00_23 电气常数   0.01ms                */
		          600,   /*H00_24 电机常数   0.01N/W-2           */
		         0x30,   /*H00_30 编码器选择                    */
		           16,   /*H00_31 直线电机极距  mm             */
		          100,   /*H00_32 光栅尺分辨率  0.01um         */
		         1800,   /*H00_33 初始电角度                     */
		         1800,   /*H00_34 u 初始电角度                     */
                   0,   //H01_22 D轴反电势补偿因子 
                   0,   //H01_23 Q轴反电势补偿因子 
                2400,   //H01_24 D轴电流环比例增益	 
                 150,   //H01_25 D轴电流环积分补偿因子	 
                2400,   //H01_27 Q轴电流环比例增益
                 150,   //H01_28 Q轴电流环积分补偿因子
                2400,   //H01_52 性能优先模式D轴比例增益
                 150,   //H01_53 性能优先模式D轴积分补偿因子
                2400,   //H01_54 性能优先模式Q轴比例增益
                 150,   //H01_55 性能优先模式Q轴积分补偿因子
};

//　00组:   汇川高响应伺服电机
//  000系列: H1系列
const STR_MOTRORPARA Motor_Parameter_SIT_H1AV[MOTOR_NUMS_SIT_H1AV] = 
{
//              /*ISMH1-50A30CB 参数,暂无该款电机，只是规划在这里，如果设此型号，就会提示ER107*/
//                   0,   /*H00_00 电机型号  RSVD   00000             */
//                   0,   /*H00_09 电机电压  0-220V                   */
//                   5,   /*H00_10 额定功率0.01KW                     */
//                  66,   /*H00_11 额定电流   0.1a                    */
//                  16,   /*H00_12 额定转矩  0.1nm                    */
//                  48,   /*H00_13 最大转矩  0.1nm                    */
//                3000,   /*H00_14 额定转速   1RPM                    */
//                6000,   /*H00_15 最大转速                           */
//                   2,   /*H00_16 惯量 10 -6 kgm2                    */
//                   4,   /*H00_17 PMSM 电机极对数                    */
//                1000,   /*H00_18 定子电阻    mOh                    */
//                 300,   /*H00_19 定子电感  Lq mH                    */
//                 300,   /*H00_20 定子电感  Ld mH                    */
//                1583,   /*H00_21 反电势系数                         */
//                  24,   /*H00_22 转矩系数                           */
//                 500,   /*H00_23 电气系数                           */
//                  50,   /*H00_24 机械系数                           */
//                   1,   /*H00_30      编码器选择                    */
//                2500,   /*H00_31      编码器线数                    */
//                   0,   /*H00_32     编码器线数 高                  */
//                1800,   /*H00_33     初始电角度                     */
//                1800,   /*H00_34    u 初始电角度                    */
//                1000,   //H01_22 D轴反电势补偿因子 
//                1000,   //H01_23 Q轴反电势补偿因子 
//                1000,   //H01_24 D轴电流环比例增益	 
//                200,    //H01_25 D轴电流环积分补偿因子	 
//                1000,   //H01_27 Q轴电流环比例增益
//                100,    //H01_28 Q轴电流环积分补偿因子
//                2000,   //H01_52 性能优先模式D轴比例增益
//                200,    //H01_53 性能优先模式D轴积分补偿因子
//                2000,   //H01_54 性能优先模式Q轴比例增益
//                100,    //H01_55 H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-10B30CB提供参数 博建省线式100W电机*/              
                     1,  /*H00_01 电机型号  RSVD   00001             */
                     0,   /*H00_09 电机电压  0-220V                  */
                    10,  /*H00_10 额定功率0.01KW                     */
                   130,  /*H00_11 额定电流   0.1a                    */
                    32,  /*H00_12 额定转矩  0.1nm                    */
                    96,  /*H00_13 最大转矩  0.1nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  5000,  /*H00_15 最大转速                           */
                     5,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  5100,  /*H00_18 定子电阻    mOh                    */
                   500,  /*H00_19 定子电感  Lq mH                    */
                   500,  /*H00_20 定子电感  Ld mH                    */
                  1500,  /*H00_21 反电势系数                         */
                    21,  /*H00_22 转矩系数                           */
                   685,  /*H00_23 电气系数                           */
                    35,  /*H00_24 机械系数                           */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1738,  /*H00_33     初始电角度                     */
                  1738,  /*H00_34    u 初始电角度                    */
                //电流环参数   20131106修改
                1000,   //H01_22 D轴反电势补偿因子 
                1100,   //H01_23 Q轴反电势补偿因子 
                900,    //H01_24 D轴电流环比例增益	 
                150,    //H01_25 D轴电流环积分补偿因子	 
                900,    //H01_27 Q轴电流环比例增益
                150,    //H01_28 Q轴电流环积分补偿因子
                2800,   //H01_52 性能优先模式D轴比例增益
                120,    //H01_53 性能优先模式D轴积分补偿因子
                2800,   //H01_54 性能优先模式Q轴比例增益
                120,    //H01_55 性能优先模絈轴积分补偿因子

//              /*ISMH1-15B30CB 参数,暂无该款电机，只是规划在这里，如果设此型号，就会提示ER107*/
//                    2,   /*H00_00 电机型号  RSVD   00002             */
//                    0,   /*H00_09 电机电压  0-220V                   */
//                   15,   /*H00_10 额定功率0.01KW                     */
//                  130,   /*H00_11 额定电流   0.1a                    */
//                   48,   /*H00_12 额定转矩  0.1nm                    */
//                  143,   /*H00_13 最大转矩  0.1nm                    */
//                 3000,   /*H00_14 额定转速   1RPM                    */
//                 6000,   /*H00_15 最大转速                           */
//                    5,   /*H00_16 惯量 10 -6 kgm2                    */
//                    4,   /*H00_17 PMSM 电机极对数                    */
//                 1000,   /*H00_18 定子电阻    mOh                    */
//                  300,   /*H00_19 定子电感  Lq mH                    */
//                  300,   /*H00_20 定子电感  Ld mH                    */
//                 2411,   /*H00_21 反电势系数                         */
//                   37,   /*H00_22 转矩系数                           */
//                  500,   /*H00_23 电气系数                           */
//                   50,   /*H00_24 机械系数                           */
//                    1,   /*H00_30      编码器选择                    */
//                 2500,   /*H00_31      编码器线数                    */
//                    0,   /*H00_32     编码器线数 高                  */
//                 1800,   /*H00_33     初始电角度                     */
//                 1800,   /*H00_34    u 初始电角度                     */
//                1000,   //H01_22 D轴反电势补偿因子 
//                1000,   //H01_23 Q轴反电势补偿因子 
//                1000,   //H01_24 D轴电流环比例增益	 
//                200,    //H01_25 D轴电流环积分补偿因子	 
//                1000,   //H01_27 Q轴电流环比例增益
//                100,    //H01_28 Q轴电流环积分补偿因子
//                2000,   //H01_52 性能优先模式D轴比例增益
//                200,    //H01_53 性能优先模式D轴积分补偿因子
//                2000,   //H01_54 性能优先模式Q轴比例增益
//                100,    //H01_55 H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-20B30CB参数*/
                    3,   /*H00_00 电机型号  RSVD   00003             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   20,   /*H00_10 额定功率0.01KW                     */
                  160,   /*H00_11 额定电流   0.1a                    */
                   63,   /*H00_12 额定转矩  0.1nm                    */
                  191,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   16,   /*H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                 1000,   /*H00_18 定子电阻    mOh                    */
                  300,   /*H00_19 定子电感  Lq mH                    */
                  300,   /*H00_20 定子电感  Ld mH                    */
                 2786,   /*H00_21 反电势系数                         */
                   45,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数   20131106修改
                500,    //H01_22 D轴反电势补偿因子 
                800,    //H01_23 Q轴反电势补偿因子 
                1400,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1400,   //H01_27 Q轴电流环比例增益
                200,    //H01_28 Q轴电流环积分补偿因子
                5000,   //H01_52 性能优先模式D轴比例增益
                60,     //H01_53 性能优先模式D轴积分补偿因子
                5000,   //H01_54 性能优先模式Q轴比例增益
                60,     //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-40B30CB 提供参数*/
                    4,   /*H00_00 电机型号  RSVD   00004             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   40,   /*H00_10 额定功率0.01KW                     */
                  280,   /*H00_11 额定电流   0.1a                    */
                  127,   /*H00_12 额定转矩  0.1nm                    */
                  382,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   27,   /*H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                 1000,   /*H00_18 定电阻    mOh                    */
                  300,   /*H00_19 定子电感  Lq mH                    */
                  300,   /*H00_20 定子电感  Ld mH                    */
                 3204,   /*H00_21 反电势系数                         */
                   51,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数    20131106修改
                500,    //H01_22 D轴反电势补偿因子 
                800,   //H01_23 Q轴反电势补偿因子 
                1050,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1050,   //H01_27 Q轴电流环比例增益
                200,    //H01_28 Q轴电流环积分补偿因子
                3900,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                3900,   //H01_54 性能优先模式Q轴比例增益
                200,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-55B30CB 提供参数*/
                    5,   /*H00_00 电机型号  RSVD   00005             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   55,   /*H00_10 额定功率0.01KW                     */
                  380,   /*H00_11 额定电流   0.1a                    */
                  175,   /*H00_12 额定转矩  0.1nm                    */
                  525,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                  104,   /*33H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                  540,   /*H00_18 定子电阻    mOh                    */
                  304,   /*H00_19 定子电感  Lq mH                    */
                  347,   /*H00_20 定子电感  Ld mH                    */
                 3142,   /*H00_21 反电势系数                         */
                   50,   /*H00_22 转矩系数                           */
                  563,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数     20131106修改
                500,    //H01_22 D轴反电势补偿因子 
                800,    //H01_23 Q轴反电势补偿因子 
                550,    //H01_24 D轴电流环比例增益	 
                450,    //H01_25 D轴电流环积分补偿因子	 
                550,    //H01_27 Q轴电流环比例增益
                450,    //H01_28 Q轴电流环积分补偿因子
                1660,   //H01_52 性能优先模式D轴比例增益
                580,    //H01_53 性能优先模式D轴积分补偿因子
                1660,   //H01_54 性能优先模式Q轴比例增益
                580,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-75B30CB提供参数*/
                    6,   /*H00_00 电机型号  RSVD   00006             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   75,   /*H00_10 额定功率0.01KW                     */
                  460,   /*H00_11 额定电流   0.1a                    */
                  239,   /*H00_12 额定转矩  0.1nm                    */
                  716,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                  130,   /*H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                  500,   /*H00_18 定子电阻    mOh                    */
                  327,   /*H00_19 定子电感  Lq mH                    */
                  387,   /*H00_20 定子电感  Ld mH                    */
                 3330,   /*H00_21 反电势系数                         */
                   51,   /*H00_22 转矩系数                           */
                  654,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数     20131106修改
                500,    //H01_22 D轴反电势补偿因子 
                800,    //H01_23 Q轴反电势补偿因子 
                500,    //H01_24 D轴电流环比例增益	 
                500,    //H01_25 D轴电流环积分补偿因子	 
                500,    //H01_27 Q轴电流环比例增益
                500,    //H01_28 Q轴电流环积分补偿因子
                1500,   //H01_52 性能优先模式D轴比例增益
                700,    //H01_53 性能优先模式D轴积分补偿因子
                1500,   //H01_54 性能优先模式Q轴比例增益
                700,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-10C30CB提供参数*/
                    7,   /*H00_00 电机型号  RSVD   00007             */
                    0,   /*H00_09 电机电压  0-220V                   */
                  100,   /*H00_10 额定功率0.01KW                     */
                  760,   /*H00_11 额定电流   0.1a                    */
                  318,   /*H00_12 额定转矩  0.1nm                    */
                  955,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                  170,   /*H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                  500,   /*H00_18 定子电阻    mOh                    */
                  300,   /*H00_19 定子电感  Lq mH                    */
                  300,   /*H00_20 定子电感  Ld mH                    */
                 3000,   /*H00_21 反电势系数                         */
                   49,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                500,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                300,    //H01_24 D轴电流环比例增益	 
                300,    //H01_25 D轴电流环积分补偿因子	 
                300,    //H01_27 Q轴电流环比例增益
                300,    //H01_28 Q轴电流环积分补偿因子
                800,    //H01_52 性能优先模式D轴比例增益
                150,    //H01_53 性能优先模式D轴积分补偿因子
                800,    //H01_54 性能优先模式Q轴比例增益
                150,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-20B30CB-Z参数 */
                  703,   /*H00_00 电机型号  RSVD   00003             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   20,   /*H00_10 额定功率0.01KW                     */
                  160,   /*H00_11 额定电流   0.1a                    */
                   64,   /*H00_12 额定转矩  0.1nm                    */
                  191,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   15,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                 3206,   /*H00_18 定子电阻    mOh                    */
                 2412,   /*H00_19 定子电感  Lq mH                    */
                 2412,   /*H00_20 定子电感  Ld mH                    */
                 2549,   /*H00_21 反电势系数                         */
                   45,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
               //电流环参数   修改没有调试过 
                 500,   //H01_22 D轴反电势补偿因子 
                 500,   //H01_23 Q轴反电势补偿因子 
                 280,   //H01_24 D轴电流环比例增益	 
                 500,   //H01_25 D轴电流环积分补偿因子	 
                 280,   //H01_27 Q轴电流环比例增益
                 500,   //H01_28 Q轴电流环积分补偿因子
                 800,   //H01_52 性能优先模式D轴比例增益
                 300,   //H01_53 性能优先模式D轴积分补偿因子
                 800,   //H01_54 性能优先模式Q轴比例增益
                 300,   //H01_55 性能优先模式Q轴积分补偿因子 

              /*ISMH1-20B30CB-ZA参数 */
                  783,   /*H00_00 电机型号  RSVD   00003             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   20,   /*H00_10 额定功率0.01KW                     */
                  160,   /*H00_11 额定电流   0.1a                    */
                   64,   /*H00_12 额定转矩  0.1nm                    */
                  191,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   15,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                 3175,   /*H00_18 定子电阻    mOh                    */
                  961,   /*H00_19 定子电感  Lq mH                    */
                  961,   /*H00_20 定子电感  Ld mH                    */
                 3008,   /*H00_21 反电势系数                         */
                   45,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
               //电流环参数   修改没有调试过 
                 800,   //H01_22 D轴反电势补偿因子 
                 800,   //H01_23 Q轴反电势补偿因子 
                 550,   //H01_24 D轴电流环比例增益	 
                 220,   //H01_25 D轴电流环积分补偿因子	 
                 550,   //H01_27 Q轴电流环比例增益
                 220,   //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                 100,   //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                 100,   //H01_55 性能优先模式Q轴积分补偿因子 

              /*ISMH1-40B30CB-Z 提供参数*/
                  704,   /*H00_00 电机型号  RSVD   00004             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   40,   /*H00_10 额定功率0.01KW                     */
                  280,   /*H00_11 额定电流   0.1a                    */
                  127,   /*H00_12 额定转矩  0.1nm                    */
                  382,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   25,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                 1690,   /*H00_18 定电阻    mOh                    */
                  720,   /*H00_19 定子电感  Lq mH                    */
                  720,   /*H00_20 定子电感  Ld mH                    */
                 2933,   /*H00_21 反电势系数                         */
                   51,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数     20131106修改
                 500,   //H01_22 D轴反电势补偿因子 
                 800,   //H01_23 Q轴反电势补偿因子 
                 650,   //H01_24 D轴电流环比例增益	 
                 250,    //H01_25 D轴电流环积分补偿因子	 
                 650,   //H01_27 Q轴电流环比例增益
                 250,    //H01_28 Q轴电流环积分补偿因子
                1500,   //H01_52 性能优先模式D轴比例增益
                 100,    //H01_53 性能优先模式D轴积分补偿因子
                1500,   //H01_54 性能优先模式Q轴比例增益
                 100,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-40B30CB-Z 提供参数*/
                  784,   /*H00_00 电机型号  RSVD   00004             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   40,   /*H00_10 额定功率0.01KW                     */
                  280,   /*H00_11 额定电流   0.1a                    */
                  127,   /*H00_12 额定转矩  0.1nm                    */
                  382,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   25,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                 1225,   /*H00_18 定电阻    mOh                    */
                  442,   /*H00_19 定子电感  Lq mH                    */
                  442,   /*H00_20 定子电感  Ld mH                    */
                 3016,   /*H00_21 反电势系数                         */
                   51,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数     20131106修改
                 500,   //H01_22 D轴反电势补偿因子 
                 800,   //H01_23 Q轴反电势补偿因子 
                 650,   //H01_24 D轴电流环比例增益	 
                 200,   //H01_25 D轴电流环积分补偿因子	 
                 650,   //H01_27 Q轴电流环比例增益
                 200,   //H01_28 Q轴电流环积分补偿因子
                1800,   //H01_52 性能优先模式D轴比例增益
                 100,   //H01_53 性能优先模式D轴积分补偿因子
                1800,   //H01_54 性能优先模式Q轴比例增益
                 100,   //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH1-75B30CB-Z 参数*/
                  706,   /*H00_00 电机型号  RSVD   00004             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   75,   /*H00_10 额定功率0.01KW                     */
                  480,   /*H00_11 额定电流   0.1a                    */
                  239,   /*H00_12 额定转矩  0.1nm                    */
                  716,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                  130,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                  650,   /*H00_18 定电阻    mOh                    */
                  530,   /*H00_19 定子电感  Lq mH                    */
                  530,   /*H00_20 定子电感  Ld mH                    */
                 3333,   /*H00_21 反电势系数                         */
                   54,   /*H00_22 转矩系数                           */
                  654,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数   没有调试过
                 500,   //H01_22 D轴反电势补偿因子 
                 800,   //H01_23 Q轴反电势补偿因子 
                 400,   //H01_24 D轴电流环比例增益	 
                 500,    //H01_25 D轴电流环积分补偿因子	 
                 400,   //H01_27 Q轴电流环比例增益
                 500,    //H01_28 Q轴电流环积分补偿因子
                1300,   //H01_52 性能优先模式D轴比例增益
                 500,    //H01_53 性能优先模式D轴积分补偿因子
                1300,   //H01_54 性能优先模式Q轴比例增益
                 500,    //H01_55 性能优先模式Q轴积分补偿因子
};

//H2组电机参数
const STR_MOTRORPARA Motor_Parameter_SIT_H2SV[MOTOR_NUMS_SIT_H2SV] = 
{              /*SIT_H2SV 10C30CD 参数*/
                 100,   /*H00_00 电机型号  RSVD   00000             */
                   1,   /*H00_09 电机电压  0-220V                   */
                 100,   /*H00_10 额定功率0.01KW                     */
                 365,   /*H00_11 额定电流   0.1a                    */
                 318,   /*H00_12 额定转矩  0.1nm                    */
                 954,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                6000,   /*H00_15 最大转速                           */
                 187,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                2030,   /*H00_18 定子电阻    mOh                    */
                 740,   /*H00_19 定子电感  Lq mH                    */
                 740,   /*H00_20 定子电感  Ld mH                    */
                5833,   /*H00_21 反电势系数                         */
                  87,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器呤?                   */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数    20131106修改
                800,    //H01_22 D轴反电势补偿因子 
                800,    //H01_23 Q轴反电势补偿因子 
                800,    //H01_24 D轴电流环比例增益	 
                70,     //H01_25 D轴电流环积分补偿因子	 
                800,    //H01_27 Q轴电流环比例增益
                70,     //H01_28 Q轴电流环积分补偿因子
                2400,   //H01_52 性能优先模式D轴比例增益
                40,     //H01_53 性能优先模式D轴积分补偿因子
                2400,   //H01_54 性能优先模式Q轴比例增益
                40,     //H01_55 性能优先模式Q轴积分补偿因子
                    
          /*SIT_H2SV 15C30CD 参数*/
                 101,   /*H00_00 电机型号  RSVD   00000             */
                   1,   /*H00_09 电机电压  0-220V                   */
                 150,   /*H00_10 额定功率0.01KW                     */
                 448,   /*H00_11 额定电流   0.1a                    */
                 490,   /*H00_12 额定转矩  0.1nm                    */
                 1470,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                 246,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                1790,   /*H00_18 定子电阻    mOh                    */
                 682,   /*H00_19 定子电感  Lq mH                    */
                 682,   /*H00_20 定子电感  Ld mH                    */
                6999,   /*H00_21 反电势系数                         */
                 109,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数     20131106修改
                1000,   //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                800,    //H01_24 D轴电流环比例增益	 
                80,     //H01_25 D轴电流环积分补偿因子	 
                800,    //H01_27 Q轴电流环比例增益
                80,     //H01_28 Q轴电流环积分补偿因子
                2800,   //H01_52 性能优先模式D轴比例增益
                60,     //H01_53 性能优先模式D轴积分补偿因子
                2800,   //H01_54 性能优先模式Q轴比例增益
                60,     //H01_55 性能优先模式Q轴积分补偿因子
                    
     /*SIT_H2SV 20C30CD 参数*/
                 102,   /*H00_00 电机型号  RSVD   00000             */
                   1,   /*H00_09 电机电压  0-220V                   */
                 200,   /*H00_10 额定功率0.01KW                     */
                 590,   /*H00_11 额定电流   0.1a                    */
                 636,   /*H00_12 额定转矩  0.1nm                    */
                1910,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                 306,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                1275,   /*H00_18 定子电阻    mOh                    */
                 510,   /*H00_19 定子电感  Lq mH                    */
                 510,   /*H00_20 定子电感  Ld mH                    */
                6999,   /*H00_21 反电势系数                         */
                 108,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数     20131106修改
                1000,   //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                450,    //H01_24 D轴电流环比例增益	 
                100,    //H01_25 D轴电流环积分补偿因子	 
                450,    //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                1400,   //H01_52 性能优先模式D轴比例增益
                50,     //H01_53 性能优先模式D轴积分补偿因子
                1400,   //H01_54 性能优先模式Q轴比例增益
                50,     //H01_55 性能优先模式Q轴积分补偿因子
                    
     /*SIT_H2SV 25C30CD 参数*/
                 103,   /*H00_00 电机型号  RSVD   00000             */
                   1,   /*H00_09 电机电压  0-220V                   */
                 250,   /*H00_10 额定功率0.01KW                     */
                 760,   /*H00_11 额定电流   0.1a                    */
                 796,   /*H00_12 额定转矩  0.1nm                    */
                2390,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                 365,    /*H00_16 惯量 10 -6 kgm2                    */
                  4,   /*H00_17 PMSM 电机极对数                    */
                1060,   /*H00_18 定子电阻    mOh                    */
                 410,   /*H00_19 定子电感  Lq mH                    */
                 410,   /*H00_20 定子电感  Ld mH                    */
                6999,   /*H00_21 反电势系数                         */
                 105,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数     20131106修改
               1000,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                450,    //H01_24 D轴电流环比例增益	 
                110,    //H01_25 D轴电流环积分补偿因子	 
                450,    //H01_27 Q轴电流环比例增益
                110,    //H01_28 Q轴电流环积分补偿因子
               1500,    //H01_52 性能优先模式D轴比例增益
                 50,    //H01_53 性能优先模式D轴积分补偿因子
               1500,    //H01_54 性能优先模式Q轴比例增益
                 50,    //H01_55 性能优先模式Q轴积分补偿因子
                    
     /*SIT_H2SV 30C30CD 参数                                        */
                 104,   /*H00_00 电机型号  RSVD   00000             */
                   1,   /*H00_09 电机电压  0-220V                   */
                 300,   /*H00_10 额定功率0.01KW                     */
                 1000,   /*H00_11 额定电流   0.1a                    */
                 980,   /*H00_12 额定转矩  0.1nm                    */
                 2940,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                 772,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                800,   /*H00_18 定子电阻    mOh                    */
                1000,   /*H00_19 定子电感  Lq mH                    */
                1000,   /*H00_20 定子电感  Ld mH                    */
                7000,   /*H00_21 反电势系数                         */
                 98,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数      20131106修改
                500,    //H01_22 D轴反电势补偿因子 
                500,    //H01_23 Q轴反电势补偿因子 
                240,    //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                240,    //H01_27 Q轴电流环比例增益
                200,    //H01_28 Q轴电流环积分补偿因子
                700,    //H01_52 性能优先模式D轴比例增益
                120,    //H01_53 性能优先模式D轴积分补偿因子
                700,    //H01_54 性能优先模式Q轴比例增益
                120,    //H01_55 性能优先模式Q轴积分补偿因子
                   
     /*SIT_H2SV 40C30CD 参数*/
                 105,   /*H00_00 电机型号  RSVD   00000             */
                   1,   /*H00_09 电机电压  0-220V                   */
                 400,   /*H00_10 额定功率0.01KW                     */
                 1360,   /*H00_11 额定电流   0.1a                    */
                 1260,   /*H00_12 额定转矩  0.1nm                    */
                 3780,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                 1210,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                300,   /*H00_18 定子电阻    mOh                    */
                443,   /*H00_19 定子电感  Lq mH                    */
                443,   /*H00_20 定子电感  Ld mH                    */
                7000,   /*H00_21 反电势系数                         */
                 93,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                500,    //H01_22 D轴反电势补偿因子 
                700,    //H01_23 Q轴反电势补偿因子 
                220,    //H01_24 D轴电流环比例增益	 
                325,    //H01_25 D轴电流环积分补偿因子	 
                220,    //H01_27 Q轴电流环比例增益
                325,    //H01_28 Q轴电流环积分补偿因子
                800,    //H01_52 性能优先模式D轴比例增益
                260,    //H01_53 性能优先模式D轴积分补偿因子
                800,    //H01_54 性能优先模式Q轴比例增益
                260,    //H01_55 性能优先模式Q轴积分补偿因子
                    
     /*SIT_H2SV 50C30CD */
                 106,   /*H00_00 电机型号  RSVD   00000             */
                   1,   /*H00_09 电机电压  0-220V                   */
                 500,   /*H00_10 额定功率0.01KW                     */
                 1600,   /*H00_11 额定电流   0.1a                    */
                 1580,   /*H00_12 额定转矩  0.1nm                    */
                 4760,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                 1540,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                 280,   /*H00_18 定子电阻    mOh                    */
                 400,   /*H00_19 定子电感  Lq mH                    */
                 400,   /*H00_20 定子电感  Ld mH                    */
                7000,   /*H00_21 反电势系数                         */
                 107,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                500,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                250,    //H01_24 D轴电流环比例增益	 
                340,    //H01_25 D轴电流环积分补偿因子	 
                250,    //H01_27 Q轴电流环比例增益
                340,    //H01_28 Q轴电流环积分补偿因子
                940,    //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                940,    //H01_54 性能优先模式Q轴比例增益
                200,    //H01_55 性能优先模式Q轴积分补偿因子

      /*SIT_H2SV2 10C30CB 参数*/
                 150,   /*H00_00 电机型号  RSVD   00000             */
                   0,   /*H00_09 电机电压  0-220V                   */
                 100,   /*H00_10 额定功率0.01KW                     */
                 750,   /*H00_11 额定电流   0.1a                    */
                 318,   /*H00_12 额定转矩  0.1nm                    */
                 954,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                6000,   /*H00_15 最大转速                           */
                 187,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                 510,   /*H00_18 定子电阻    mOh                    */
                 185,   /*H00_19 定子电感  Lq mH                    */
                 185,   /*H00_20 定子电感  Ld mH                    */
                2900,   /*H00_21 反电势系数                         */
                  43,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器呤?                   */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数   20131106修改
                700,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                800,    //H01_24 D轴电流环比例增益	 
                80,     //H01_25 D轴电流环积分补偿因子	 
                800,    //H01_27 Q轴电流环比例增益
                80,     //H01_28 Q轴电流环积分补偿因子
                2500,   //H01_52 性能优先模式D轴比例增益
                100,    //H01_53 性能优先模式D轴积分补偿因子
                2500,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子
                      
          /*SIT_H2SV2 15C30CB 参数*/
                 151,   /*H00_00 电机型号  RSVD   00000             */
                   0,   /*H00_09 电机电压  0-220V                   */
                 150,   /*H00_10 额定功率0.01KW                     */
                 1080,   /*H00_11 额定电流   0.1a                    */
                 490,   /*H00_12 额定转矩  0.1nm                    */
                 1470,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                 246,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                450,   /*H00_18 定子电阻    mOh                    */
                 171,   /*H00_19 定子电感  Lq mH                    */
                 171,   /*H00_20 定子电感  Ld mH                    */
                3500,   /*H00_21 反电势系数                         */
                  45,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数    20131106修改
                800,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                750,    //H01_24 D轴电流环比例增益	 
                100,    //H01_25 D轴电流环积分补偿因子	 
                750,    //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2200,   //H01_52 性能优先模式D轴比例增益
                80,     //H01_53 性能优先模式D轴积分补偿因子
                2200,   //H01_54 性能优先模式Q轴比例增益
                80,     //H01_55 性能优先模式Q轴积分补偿因子                   

     /*SIT_H2SV 40C30CB 参数*/
                 155,   /*H00_00 电机型号  RSVD   00000             */
                   0,   /*H00_09 电机电压  0-220V                   */
                 400,   /*H00_10 额定功率0.01KW                     */
                 1360,   /*H00_11 额定电流   0.1a                    */
                 1260,   /*H00_12 额定转矩  0.1nm                    */
                 3780,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                3000,   /*H00_15 最大转速                           */
                 1210,    /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                300,   /*H00_18 定子电阻    mOh                    */
                443,   /*H00_19 定子电感  Lq mH                    */
                443,   /*H00_20 定子电感  Ld mH                    */
                7000,   /*H00_21 反电势系数                         */
                 93,   /*H00_22 转矩系数                           */
                 500,   /*H00_23 电气系数                           */
                 100,   /*H00_24 机械系数                           */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                500,    //H01_22 D轴反电势补偿因子 
                700,    //H01_23 Q轴反电势补偿因子 
                220,    //H01_24 D轴电流环比例增益	 
                325,    //H01_25 D轴电流环积分补偿因子	 
                220,    //H01_27 Q轴电流环比例增益
                325,    //H01_28 Q轴电流环积分补偿因子
                800,    //H01_52 性能优先模式D轴比例增益
                260,    //H01_53 性能优先模式D轴积分补偿因子
                800,    //H01_54 性能优先模式Q轴比例增益
                260,    //H01_55 性能优先模式Q轴积分补偿因子
};

//　00组:   汇川高响应伺服电机
//  200系列: H3系列
const STR_MOTRORPARA Motor_Parameter_SIT_H3SV[MOTOR_NUMS_SIT_H3SV] = 
{
             /*SIT_H3AV 45B15CD 参数*/
                 210,   /*H00_00 电机型号  RSVD   00000             */
               1    ,   /*H00_09 电机电压  0-220V                   */
               45   ,   /*H00_10 额定功率0.01KW                     */
               200  ,   /*H00_11 额定电流   0.1a                    */
               287  ,   /*H00_12 额定转矩  0.1nm                    */
               720  ,   /*H00_13 最大转矩  0.1nm                    */
               1500 ,   /*H00_14 额定转速   1RPM                    */
               3000 ,   /*H00_15 最大转速                           */
               685  ,   /*H00_16 惯量 10 -6 kgm2                    */
               4    ,   /*H00_17 PMSM 电机极对数                    */
               9520 ,   /*H00_18 定子电阻    mOh                    */
               2080 ,   /*H00_19 定子电感  Lq mH                    */
               2080 ,   /*H00_20 定子电感  Ld mH                    */
               10000,   /*H00_21 反电势系数                         */
               143  ,   /*H00_22 转矩系数                           */
               500  ,   /*H00_23 电气系数                           */
               100  ,   /*H00_24 机械系数                           */
               1    ,   /*H00_30      编码器选择                    */
               2500 ,   /*H00_31      编码器线数                    */
               0    ,   /*H00_32     编码器线数 高                  */
               1800 ,   /*H00_33     初始电角度                     */
               1800 ,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                529,    //H01_24 D轴电流环比例增益	 
                121,    //H01_25 D轴电流环积分补偿因子	 
                529,    //H01_27 Q轴电流环比例增益
                121,    //H01_28 Q轴电流环积分补偿因子
                529,    //H01_52 性能优先模式D轴比例增益
                121,    //H01_53 性能优先模式D轴积分补偿因子
                529,    //H01_54 性能优先模式Q轴比例增益
                121,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_H3AV 85b15cd提供参数*/
                   211,  /*H00_00 电机型号  RSVD   00001             */
                  1    ,   /*H00_09 电机电压  0-220V                  */
                  85   ,  /*H00_10 额定功率0.01KW                     */
                  330  ,  /*H00_11 额定电流   0.1a                    */
                  539  ,  /*H00_12 额定转矩  0.1nm                    */
                  1350 ,  /*H00_13 最大转矩  0.1nm                    */
                  1500 ,  /*H00_14 额定转速   1RPM                    */
                  3000 ,  /*H00_15 最大转速                           */
                  1300 ,  /*H00_16 惯量 10 -6 kgm2                    */
                  4    ,  /*H00_17 PMSM 电机极对数                    */
                  3900 ,  /*H00_18 定子电阻    mOh                    */
                  1040 ,  /*H00_19 定子电感  Lq mH                    */
                  1040 ,  /*H00_20 定子电感  Ld mH                    */
                  10000,  /*H00_21 反电势系数                         */
                  175  ,  /*H00_22 转矩系数                           */
                  500  ,  /*H00_23 电气系数                           */
                  100  ,  /*H00_24 机械系数                           */
                  1    ,  /*H00_30      编码器选择                    */
                  2500 ,  /*H00_31      编码器线数                    */
                  0    ,  /*H00_32     编码器线数 高                  */
                  1800 ,  /*H00_33     初始电角度                     */
                  1800 ,  /*H00_34    u 初始电角度                    */
                //电流环参数     20131106修改
                1000,   //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                700,    //H01_24 D轴电流环比例增益	 
                80,     //H01_25 D轴电流环积分补偿因子	 
                700,    //H01_27 Q轴电流环比例增益
                80,     //H01_28 Q轴电流环积分补偿因子
                2590,   //H01_52 性能优先模式D轴比例增益
                40,     //H01_53 性能优先模式D轴积分补偿因子
                2590,   //H01_54 性能优先模式Q轴比例增益
                40,     //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_H3AV 13c15cd参数*/
                 212,     /*H00_00 电机型号  RSVD   00002             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 130  ,   /*H00_10 额定功率0.01KW                     */
                 500  ,   /*H00_11 额定电流   0.1a                    */
                 834  ,   /*H00_12 额定转矩  0.1nm                    */
                 2085 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 3000 ,   /*H00_15 最大转速                           */
                 1930 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 4    ,   /*H00_17 PMSM 电机极对数                    */
                 2380 ,   /*H00_18 定子电阻    mOh                    */
                 680  ,   /*H00_19 定子电感  Lq mH                    */
                 680  ,   /*H00_20 定子电感  Ld mH                    */
                 10000,   /*H00_21 反电势系数                         */
                 178  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 100  ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,   /*H00_34    u 初始电角度                     */
                //电流环参数    20131106修改
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                650,    //H01_24 D轴电流环比例增益	 
                70,    //H01_25 D轴电流环积分补偿因子	 
                650,    //H01_27 Q轴电流环比例增益
                70,     //H01_28 Q轴电流环积分补偿因子
                1800,   //H01_52 性能优先模式D轴比例增益
                40,     //H01_53 性能优先模式D轴积分补偿因子
                1800,   //H01_54 性能优先模式Q轴比例增益
                40,     //H01_55 性能优先模式Q轴积分补偿因子
                     
              /*SIT_H3AV 18c15cd参数*/
                 213,     /*H00_00 电机型号  RSVD   00003             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 180  ,   /*H00_10 额定功率0.01KW                     */
                 660  ,   /*H00_11 额定电流   0.1a                    */
                 1150 ,   /*H00_12 额定转矩  0.1nm                    */
                 2875 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 3000 ,   /*H00_15 最大转速                           */
                 2550 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 4    ,   /*H00_17 PMSM 电机极对数                    */
                 1640 ,   /*H00_18 定子电阻    mOh                    */
                 520  ,   /*H00_19 定子电感  Lq mH                    */
                 520  ,   /*H00_20 定子电感  Ld mH                    */
                 10000,   /*H00_21 反电势系数                         */
                 180  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 100  ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,   /*H00_34    u 初始电角度                     */
                //电流环参数    20131106修改
                600,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                430,    //H01_24 D轴电流环比例增益	 
                85,     //H01_25 D轴电流环积分补偿因子	 
                430,    //H01_27 Q轴电流环比例增益
                85,     //H01_28 Q轴电流环积分补偿因子
                1500,   //H01_52 性能优先模式D轴比例增益
                50,     //H01_53 性能优先模式D轴积分补偿因子
                1500,   //H01_54 性能优先模式Q轴比例增益
                50,     //H01_55 性能优先模式Q轴积分补偿因子
                     
              /*SIT_H3AV 29c15cd*/
                 214,     /*H00_00 电机型号  RSVD   00004             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 290  ,   /*H00_10 额定功率0.01KW                     */
                 1190 ,   /*H00_11 额定电流   0.1a                    */
                 1860 ,   /*H00_12 额定转矩  0.1nm                    */
                 4510 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 3000 ,   /*H00_15 最大转速                           */
                 5500 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 4    ,   /*H00_17 PMSM 电机极对数                    */
                 220  ,   /*H00_18 定电阻    mOh                    */
                 400 ,   /*H00_19 定子电感  Lq mH                    */
                 400 ,   /*H00_20 定子电感  Ld mH                    */
                 11100,   /*H00_21 反电势系数                         */
                 170  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 50   ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                300,    //H01_22 D轴反电势补偿因子 
                500,    //H01_23 Q轴反电势补偿因子 
                400,    //H01_24 D轴电流环比例增益	 
                150,    //H01_25 D轴电流环积分补偿因子	 
                400,    //H01_27 Q轴电流环比例增益
                150,    //H01_28 Q轴电流环积分补偿因子
                1000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                1000,   //H01_54 性能优先模式Q轴比例增益
                200,    //H01_55 性能优先模式Q轴积分补偿因子
                     
              /*SIT_H3AV 44c15cd*/
                  215,   /*H00_00 电机型号  RSVD   00005             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                440  ,   /*H00_10 额定功率0.01KW                     */
                1650 ,   /*H00_11 额定电流   0.1a                    */
                2840 ,   /*H00_12 额定转矩  0.1nm                    */
                7110 ,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                3000 ,   /*H00_15 最大转速                           */
                8890 ,   /*H00_16 惯量 10 -6 kgm2 //2010-12-06 xiongfei                  */
                4    ,   /*H00_17 PMSM 电机极对数                    */
                150  ,   /*H00_18 定子电阻    mOh                    */
                330 ,   /*H00_19 定子电感  Lq mH                    */
                330 ,   /*H00_20 定子电感  Ld mH                    */
                11000,   /*H00_21 反电势系数                         */
                193  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                100  ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                404,    //H01_24 D轴电流环比例增益	 
                428,    //H01_25 D轴电流环积分补偿因子	 
                404,    //H01_27 Q轴电流环比例增益
                428,    //H01_28 Q轴电流环积分补偿因子
                404,    //H01_52 性能优先模式D轴比例增益
                428,    //H01_53 性能优先模式D轴积分补偿因子
                404,    //H01_54 性能优先模式Q轴比例增益
                428,    //H01_55 性能优先模式Q轴积分补偿因子
                     
              /*SIT_H3AV 55c15cd*/
                  216,   /*H00_00 电机型号  RSVD   00006             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                550  ,   /*H00_10 额定功率0.01KW                     */
                2080 ,   /*H00_11 额定电流   0.1a                    */
                3500 ,   /*H00_12 额定转矩  0.1nm                    */
                8760 ,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                3000 ,   /*H00_15 最大转速                           */
                10700,   /*H00_16 惯量 10 -6 kgm2                    */
                4    ,   /*H00_17 PMSM 电机极对数                    */
                110  ,   /*H00_18 定子电阻    mOh                    */
                250 ,   /*H00_19 定子电感  Lq mH                    */
                250 ,   /*H00_20 定子电感  Ld mH                    */
                11600,   /*H00_21 反电势系数                         */
                180  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                100  ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                352,    //H01_24 D轴电流环比例增益	 
                379,    //H01_25 D轴电流环积分补偿因子	 
                352,    //H01_27 Q轴电流环比例增益
                379,    //H01_28 Q轴电流环积分补偿因子
                352,    //H01_52 性能优先模式D轴比例增益
                379,    //H01_53 性能优先模式D轴积分补偿因子
                352,    //H01_54 性能优先模式Q轴比例增益
                379,    //H01_55 性能优先模式Q轴积分补偿因子
                     
              /*SIT_H3AV 75c15cd*/
                  217,   /*H00_00 电机型号  RSVD   00007             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                750  ,   /*H00_10 额定功率0.01KW                     */
                2570 ,   /*H00_11 额定电流   0.1a                    */
                4800 ,   /*H00_12 额定转矩  0.1nm                    */
                11900,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                3000 ,   /*H00_15 最大转速                           */
                14100,   /*H00_16 惯量 10 -6 kgm2                    */
                4    ,   /*H00_17 PMSM 电机极对数                    */
                //电感电阻参数继承212
                340  ,   /*H00_18 定子电阻    mOh                    */
                1600 ,   /*H00_19 定子电感  Lq mH                    */
                1600 ,   /*H00_20 定子电感  Ld mH                    */
                11500,   /*H00_21 反电势系数                         */
                192  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                100  ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                200,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                48,     //H01_24 D轴电流环比例增益	 
                941,    //H01_25 D轴电流环积分补偿因子	 
                48,     //H01_27 Q轴电流环比例增益
                941,    //H01_28 Q轴电流环积分补偿因子
                48,     //H01_52 性能优先模式D轴比例增益
                941,    //H01_53 性能优先模式D轴积分补偿因子
                48,     //H01_54 性能优先模式Q轴比例增益
                941,    //H01_55 性能优先模式Q轴积分补偿因子

                /*SIT_H3SV2 87b10CD 参数*/
                  222,   /*H00_00 电机型号  RSVD   00000             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                87   ,   /*H00_10 额定功率0.01KW                     */
                340  ,   /*H00_11 额定电流   0.1a                    */
                834  ,   /*H00_12 额定转矩  0.1nm                    */
               2085  ,   /*H00_13 最大转矩  0.1nm                    */
                1000 ,   /*H00_14 额定转速   1RPM                    */
                2000 ,   /*H00_15 最大转速                           */
               1930  ,   /*H00_16 惯量 10 -6 kgm2                    */
                4    ,   /*H00_17 PMSM 电机极对数                    */
                5300 ,   /*H00_18 定子电阻    mOh                    */
                1020 ,   /*H00_19 定子电感  Lq mH                    */
                1020 ,   /*H00_20 定子电感  Ld mH                    */
                15000,   /*H00_21 反电势系数                         */
                250  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                100  ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                352,    //H01_24 D轴电流环比例增益	 
                192,    //H01_25 D轴电流环积分补偿因子	 
                352,    //H01_27 Q轴电流环比例增益
                192,    //H01_28 Q轴电流环积分补偿因子
                352,    //H01_52 性能优先模式D轴比例增益
                192,    //H01_53 性能优先模式D轴积分补偿因子
                352,    //H01_54 性能优先模式Q轴比例增益
                192,    //H01_55 性能优先模式Q轴积分补偿因子
              
              /*SIT_H3SV2 12C10cd提供参数*/
                223,  /*H00_00 电机型号  RSVD   00001             */
              1    ,   /*H00_09 电机电压  0-220V                  */
             120   ,  /*H00_10 额定功率0.01KW                     */
              480  ,  /*H00_11 额定电流   0.1a                    */
             1150  ,  /*H00_12 额定转矩  0.1nm                    */
              2875 ,  /*H00_13 最大转矩  0.1nm                    */
              1000 ,  /*H00_14 额定转速   1RPM                    */
              2000 ,  /*H00_15 最大转速                           */
              2550 ,  /*H00_16 惯量 10 -6 kgm2                    */
              4    ,  /*H00_17 PMSM 电机极对数                    */
              3450 ,  /*H00_18 定子电阻    mOh                    */
               780 ,  /*H00_19 定子电感  Lq mH                    */
               780 ,  /*H00_20 定子电感  Ld mH                    */
              15000,  /*H00_21 反电势系数                         */
              240  ,  /*H00_22 转矩系数                           */
              500  ,  /*H00_23 电气系数                           */
              100  ,  /*H00_24 机械系数                           */
              1    ,  /*H00_30      编码器选择                    */
              2500 ,  /*H00_31      编码器线数                    */
              0    ,  /*H00_32     编码器线数 高                  */
              1800 ,  /*H00_33     初始电角度                     */
              1800 ,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                326,    //H01_24 D轴电流环比例增益	 
                226,    //H01_25 D轴电流环积分补偿因子	 
                326,    //H01_27 Q轴电流环比例增益
                226,    //H01_28 Q轴电流环积分补偿因子
                326,    //H01_52 性能优先模式D轴比例增益
                226,    //H01_53 性能优先模式D轴积分补偿因子
                326,    //H01_54 性能优先模式Q轴比例增益
                226,    //H01_55 性能优先模式Q轴积分补偿因子

           /*SIT_H3SV3 85b15CB 参数*/
                261,   /*H00_00 电机型号  RSVD   00000             */
              0    ,   /*H00_09 电机电压  0-220V                   */
              85   ,   /*H00_10 额定功率0.01KW                     */
              660  ,   /*H00_11 额定电流   0.1a                    */
              539  ,   /*H00_12 额定转矩  0.1nm                    */
             1350  ,   /*H00_13 最大转矩  0.1nm                    */
              1500 ,   /*H00_14 额定转速   1RPM                    */
              3000 ,   /*H00_15 最大转速                           */
             1300  ,   /*H00_16 惯量 10 -6 kgm2                    */
              4    ,   /*H00_17 PMSM 电机极对数                    */
               975 ,   /*H00_18 定子电阻    mOh                    */
               260 ,   /*H00_19 定子电感  Lq mH                    */
               260 ,   /*H00_20 定子电感  Ld mH                    */
               5000,   /*H00_21 反电势系数                         */
               90  ,   /*H00_22 转矩系数                           */
              500  ,   /*H00_23 电气系数                           */
               50  ,   /*H00_24 机械系数                           */
              1    ,   /*H00_30      编码器选择                    */
              2500 ,   /*H00_31      编码器线数                    */
              0    ,   /*H00_32     编码器线数 高                  */
              1800 ,   /*H00_33     初始电角度                     */
              1800 ,   /*H00_34    u 初始电角度                    */
                //电流环参数     20131106修改
                800,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                700,    //H01_24 D轴电流环比例增益	 
                80,    //H01_25 D轴电流环积分补偿因子	 
                700,    //H01_27 Q轴电流环比例增益
                80,     //H01_28 Q轴电流环积分补偿因子
                2100,   //H01_52 性能优先模式D轴比例增益
                70,    //H01_53 性能优先模式D轴积分补偿因子
                2100,   //H01_54 性能优先模式Q轴比例增益
                70,     //H01_55 性能优先模式Q轴积分补偿因子
              
              /*SIT_H3SV3 13C15cB提供参数*/
                262,  /*H00_00 电机型号  RSVD   00001             */
              0    ,   /*H00_09 电机电压  0-220V                  */
             130   ,  /*H00_10 额定功率0.01KW                     */
             1000  ,  /*H00_11 额定电流   0.1a                    */
              834  ,  /*H00_12 额定转矩  0.1nm                    */
              2085 ,  /*H00_13 最大转矩  0.1nm                    */
              1500 ,  /*H00_14 额定转速   1RPM                    */
              3000 ,  /*H00_15 最大转速                           */
              1930 ,  /*H00_16 惯量 10 -6 kgm2                    */
              4    ,  /*H00_17 PMSM 电机极对数                    */
               595 ,  /*H00_18 定子电阻    mOh                    */
               170 ,  /*H00_19 定子电感  Lq mH                    */
               170 ,  /*H00_20 定子电感  Ld mH                    */
               5000,  /*H00_21 反电势系数                         */
               90  ,  /*H00_22 转矩系数                           */
              500  ,  /*H00_23 电气系数                           */
               50  ,  /*H00_24 机械系数                           */
              1    ,  /*H00_30      编码器选择                    */
              2500 ,  /*H00_31      编码器线数                    */
              0    ,  /*H00_32     编码器线数 高                  */
              1800 ,  /*H00_33     初始电角度                     */
              1800 ,  /*H00_34    u 初始电角度                    */
                //电流环参数  20131106修改
                800,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                650,    //H01_24 D轴电流环比例增益	 
                100,    //H01_25 D轴电流环积分补偿因子	 
                650,    //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2380,   //H01_52 性能优先模式D轴比例增益
                40,     //H01_53 性能优先模式D轴积分补偿因子
                2380,   //H01_54 性能优先模式Q轴比例增益
                40,     //H01_55 性能优先模式Q轴积分补偿因子

             /*SIT_H3SV3 18C15cB提供参数*/
                263,  /*H00_00 电机型号  RSVD   00001             */
              0    ,   /*H00_09 电机电压  0-220V                  */
             180   ,  /*H00_10 额定功率0.01KW                     */
             1320  ,  /*H00_11 额定电流   0.1a                    */
             1150  ,  /*H00_12 额定转矩  0.1nm                    */
              2875 ,  /*H00_13 最大转矩  0.1nm                    */
              1500 ,  /*H00_14 额定转速   1RPM                    */
              3000 ,  /*H00_15 最大转速                           */
              2550 ,  /*H00_16 惯量 10 -6 kgm2                    */
              4    ,  /*H00_17 PMSM 电机极对数                    */
               410 ,  /*H00_18 定子电阻    mOh                    */
               130 ,  /*H00_19 定子电感  Lq mH                    */
               130 ,  /*H00_20 定子电感  Ld mH                    */
               5000,  /*H00_21 反电势系数                         */
               87  ,  /*H00_22 转矩系数                           */
              500  ,  /*H00_23 电气系数                           */
               50  ,  /*H00_24 机械系数                           */
              1    ,  /*H00_30      编码器选择                    */
              2500 ,  /*H00_31      编码器线数                    */
              0    ,  /*H00_32     编码器线数 高                  */
              1800 ,  /*H00_33     初始电角度                     */
              1800 ,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                500,    //H01_22 D轴反电势补偿因子 
               1000,    //H01_23 Q轴反电势补偿因子 
                400,    //H01_24 D轴电流环比例增益	 
                110,    //H01_25 D轴电流环积分补偿因子	 
                400,    //H01_27 Q轴电流环比例增益
                110,    //H01_28 Q轴电流环积分补偿因子
               1500,    //H01_52 性能优先模式D轴比例增益
                110,    //H01_53 性能优先模式D轴积分补偿因子
               1500,    //H01_54 性能优先模式Q轴比例增益
                110,    //H01_55 性能优先模式Q轴积分补偿因子

               /*SIT_H3SV4 87b10CB 参数*/
                272,   /*H00_00 电机型号  RSVD   00000             */
              0    ,   /*H00_09 电机电压  0-220V                   */
              87   ,   /*H00_10 额定功率0.01KW                     */
              680  ,   /*H00_11 额定电流   0.1a                    */
              834  ,   /*H00_12 额定转矩  0.1nm                    */
             2085  ,   /*H00_13 最大转矩  0.1nm                    */
              1000 ,   /*H00_14 额定转速   1RPM                    */
              2000 ,   /*H00_15 最大转速                           */
             1930  ,   /*H00_16 惯量 10 -6 kgm2                    */
              4    ,   /*H00_17 PMSM 电机极对数                    */
              1325 ,   /*H00_18 定子电阻    mOh                    */
               255 ,   /*H00_19 定子电感  Lq mH                    */
               255 ,   /*H00_20 定子电感  Ld mH                    */
               7500,   /*H00_21 反电势系数                         */
              120  ,   /*H00_22 转矩系数                           */
              500  ,   /*H00_23 电气系数                           */
               50  ,   /*H00_24 机械系数                           */
              1    ,   /*H00_30      编码器选择                    */
              2500 ,   /*H00_31      编码器线数                    */
              0    ,   /*H00_32     编码器线数 高                  */
              1800 ,   /*H00_33     初始电角度                     */
              1800 ,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                100,    //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                728,    //H01_24 D轴电流环比例增益	 
                86,     //H01_25 D轴电流环积分补偿因子	 
                728,    //H01_27 Q轴电流环比例增益
                86,     //H01_28 Q轴电流环积分补偿因子
                728,    //H01_52 性能优先模式D轴比例增益
                86,     //H01_53 性能优先模式D轴积分补偿因子
                728,    //H01_54 性能优先模式Q轴比例增益
                86,     //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_H3SV4 12C10cB提供参数*/
                273,  /*H00_00 电机型号  RSVD   00001             */
              0    ,   /*H00_09 电机电压  0-220V                  */
             120   ,  /*H00_10 额定功率0.01KW                     */
             1060  ,  /*H00_11 额定电流   0.1a                    */
             1150  ,  /*H00_12 额定转矩  0.1nm                    */
              2875 ,  /*H00_13 最大转矩  0.1nm                    */
              1000 ,  /*H00_14 额定转速   1RPM                    */
              2000 ,  /*H00_15 最大转速                           */
              2550 ,  /*H00_16 惯量 10 -6 kgm2                    */
              4    ,  /*H00_17 PMSM 电机极对数                    */
               863 ,  /*H00_18 定子电阻    mOh                    */
               195 ,  /*H00_19 定子电感  Lq mH                    */
               195 ,  /*H00_20 定子电感  Ld mH                    */
               7500,  /*H00_21 反电势系数                         */
              110  ,  /*H00_22 转矩系数                           */
              500  ,  /*H00_23 电气系数                           */
               50  ,  /*H00_24 机械系数                           */
              1    ,  /*H00_30      编码器选择                    */
              2500 ,  /*H00_31      编码器线数                    */
              0    ,  /*H00_32     编码器线数 高                  */
              1800 ,  /*H00_33     初始电角度                     */
              1800 ,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                674,    //H01_24 D轴电流环比例增益	 
                126,    //H01_25 D轴电流环积分补偿因子	 
                674,    //H01_27 Q轴电流环比例增益
                126,    //H01_28 Q轴电流环积分补偿因子
                674,    //H01_52 性能优先模式D轴比例增益
                126,    //H01_53 性能优先模式D轴积分补偿因子
                674,    //H01_54 性能优先模式Q轴比例增益
                126,    //H01_55 性能优先模式Q轴积分补偿因子
};

//　00组:   汇川高响应伺服电机
//  600系列: H4系列

const STR_MOTRORPARA Motor_Parameter_SIT_H4SV[MOTOR_NUMS_SIT_H4SV] = 
{
             /*ISMH4-40B30CB 参数*/
               600  ,   /*H00_00 电机型号  RSVD   00000             */
               0    ,   /*H00_09 电机电压  0-220V                   */
               40   ,   /*H00_10 额定功率0.01KW                     */
               280  ,   /*H00_11 额定电流   0.1a                    */
               127  ,   /*H00_12 额定转矩  0.1nm                    */
               382  ,   /*H00_13 最大转矩  0.1nm                    */
               3000 ,   /*H00_14 额定转速   1RPM                    */
               6000 ,   /*H00_15 最大转速                           */
               67  ,   /*H00_16 惯量 10 -6 kgm2                    */
               4    ,   /*H00_17 PMSM 电机极对数                    */
               1000 ,   /*H00_18 定子电阻    mOh                    */
               300 ,   /*H00_19 定子电感  Lq mH                    */
               300 ,   /*H00_20 定子电感  Ld mH                    */
               3000,   /*H00_21 反电势系数                         */
               51  ,   /*H00_22 转矩系数                           */
               500  ,   /*H00_23 电气系数                           */
               50  ,   /*H00_24 机械系数                           */
               1    ,   /*H00_30      编码器选择                    */
               2500 ,   /*H00_31      编码器线数                    */
               0    ,   /*H00_32     编码器线数 高                  */
               1800 ,   /*H00_33     初始电角度                     */
               1800 ,   /*H00_34    u 初始电角度                    */
               //电流环参数      20131106修改
               500,    //H01_22 D轴反电势补偿因子 
               800,    //H01_23 Q轴反电势补偿因子 
               1050,   //H01_24 D轴电流环比例增益	 
               320,    //H01_25 D轴电流环积分补偿因子	 
               1050,   //H01_27 Q轴电流环比例增益
               320,    //H01_28 Q轴电流环积分补偿因子
               4000,   //H01_52 性能优先模式D轴比例增益
               200,    //H01_53 性能优先模式D轴积分补偿因子
               4000,   //H01_54 性能优先模式Q轴比例增益
               200,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH4-40B30CB-Z 提供参数*/
                  804,   /*H00_00 电机型号  RSVD   00004             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   40,   /*H00_10 额定功率0.01KW                     */
                  280,   /*H00_11 额定电流   0.1a                    */
                  127,   /*H00_12 额定转矩  0.1nm                    */
                  382,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   65,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                 1690,   /*H00_18 定电阻    mOh                    */
                  720,   /*H00_19 定子电感  Lq mH                    */
                  720,   /*H00_20 定子电感  Ld mH                    */
                 2933,   /*H00_21 反电势系数                         */
                   51,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数    20131106修改
                 500,   //H01_22 D轴反电势补偿因子 
                 500,   //H01_23 Q轴反电势补偿因子 
                 650,   //H01_24 D轴电流环比例增益	 
                 220,    //H01_25 D轴电流环积分补偿因子	 
                 650,   //H01_27 Q轴电流环比例增益
                 220,    //H01_28 Q轴电流环积分补偿因子
                1800,   //H01_52 性能优先模式D轴比例增益
                 100,    //H01_53 性能优先模式D轴积分补偿因子
                1800,   //H01_54 性能优先模式Q轴比例增益
                 100,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH4-40B30CB-Z 提供参数*/
                  884,   /*H00_00 电机型号  RSVD   00004             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   40,   /*H00_10 额定功率0.01KW                     */
                  280,   /*H00_11 额定电流   0.1a                    */
                  127,   /*H00_12 额定转矩  0.1nm                    */
                  382,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                   65,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                 1225,   /*H00_18 定电阻    mOh                    */
                  442,   /*H00_19 定子电感  Lq mH                    */
                  442,   /*H00_20 定子电感  Ld mH                    */
                 3016,   /*H00_21 反电势系数                         */
                   51,   /*H00_22 转矩系数                           */
                  500,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数    20131106修改
                 500,   //H01_22 D轴反电势补偿因子 
                 500,   //H01_23 Q轴反电势补偿因子 
                 650,   //H01_24 D轴电流环比例增益	 
                 220,    //H01_25 D轴电流环积分补偿因子	 
                 650,   //H01_27 Q轴电流环比例增益
                 220,    //H01_28 Q轴电流环积分补偿因子
                1800,   //H01_52 性能优先模式D轴比例增益
                 100,    //H01_53 性能优先模式D轴积分补偿因子
                1800,   //H01_54 性能优先模式Q轴比例增益
                 100,    //H01_55 性能优先模式Q轴积分补偿因子

              /*ISMH4-75B30CB-Z 提供参数*/
                  806,   /*H00_00 电机型号  RSVD   00004             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   75,   /*H00_10 额定功率0.01KW                     */
                  480,   /*H00_11 额定电流   0.1a                    */
                  239,   /*H00_12 额定转矩  0.1nm                    */
                  716,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 6000,   /*H00_15 最大转速                           */
                  193,   /*H00_16 惯量 10 -6 kgm2                    */
                    5,   /*H00_17 PMSM 电机极对数                    */
                  650,   /*H00_18 定电阻    mOh                    */
                  530,   /*H00_19 定子电感  Lq mH                    */
                  530,   /*H00_20 定子电感  Ld mH                    */
                 3333,   /*H00_21 反电势系数                         */
                   54,   /*H00_22 转矩系数                           */
                  654,   /*H00_23 电气系数                           */
                   50,   /*H00_24 机械系数                           */
                    1,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数    20131106修改
                 500,   //H01_22 D轴反电势补偿因子 
                 800,   //H01_23 Q轴反电势补偿因子 
                 400,   //H01_24 D轴电流环比例增益	 
                 500,    //H01_25 D轴电流环积分补偿因子	 
                 400,   //H01_27 Q轴电流环比例增益
                 500,    //H01_28 Q轴电流环积分补偿因子
                1400,   //H01_52 性能优先模式D轴比例增益
                 500,    //H01_53 性能优先模式D轴积分补偿因子
                1400,   //H01_54 性能优先模式Q轴比例增益
                 500,    //H01_55 性能优先模式Q轴积分补偿因子
};


//　00组:   汇川伺服电机
// H3-Z系列                                //增加汇川H3-Z系列电机参数数组  by 熊飞
const STR_MOTRORPARA Motor_Parameter_SIT_H3ZSV[MOTOR_NUMS_SIT_H3ZSV] = 
{              /*SIT_H3ZAV 29c15cd*/
                  714,   /*H00_00 电机型号  RSVD   00004             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 290  ,   /*H00_10 额定功率0.01KW                     */
                 1190 ,   /*H00_11 额定电流   0.1a                    */
                 1860 ,   /*H00_12 额定转矩  0.1nm                    */
                 4510 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 3000 ,   /*H00_15 最大转速                           */
                 5500 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 5    ,   /*H00_17 PMSM 电机极对数                    */
                 264  ,   /*H00_18 定电阻    mOh                    */
                 546 ,   /*H00_19 定子电感  Lq mH                    */
                 546 ,   /*H00_20 定子电感  Ld mH                    */
                 11100,   /*H00_21 反电势系数                         */
                 170  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 50   ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数   20131106修改
                500,    //H01_22 D轴反电势补偿因子 
                800,    //H01_23 Q轴反电势补偿因子 
                400,    //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                400,    //H01_27 Q轴电流环比例增益
                200,    //H01_28 Q轴电流环积分补偿因子
                1500,   //H01_52 性能优先模式D轴比例增益
                100,    //H01_53 性能优先模式D轴积分补偿因子
                1500,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子
                                     
              /*SIT_H3ZAV 44c15cd*/
                  715,   /*H00_00 电机型号  RSVD   00005             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                440  ,   /*H00_10 额定功率0.01KW                     */
                1650 ,   /*H00_11 额定电流   0.1a                    */
                2840 ,   /*H00_12 额定转矩  0.1nm                    */
                7110 ,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                3000 ,   /*H00_15 最大转速                           */
                8890 ,   /*H00_16 惯量 10 -6 kgm2 //2010-12-06 xiongfei                  */
                5    ,   /*H00_17 PMSM 电机极对数                    */
                170  ,   /*H00_18 定子电阻    mOh                    */
                380 ,   /*H00_19 定子电感  Lq mH                    */
                380 ,   /*H00_20 定子电感  Ld mH                    */
                11000,   /*H00_21 反电势系数                         */
                193  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                100  ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                700,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                350,    //H01_24 D轴电流环比例增益	 
                300,    //H01_25 D轴电流环积分补偿因子	 
                350,    //H01_27 Q轴电流环比例增益
                300,    //H01_28 Q轴电流环积分补偿因子
               1200,    //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
               1200,    //H01_54 性能优先模式Q轴比例增益
                200,    //H01_55 性能优先模式Q轴积分补偿因子
                                     
              /*SIT_H3ZAV 55c15cd*/
                  716,   /*H00_00 电机型号  RSVD   00006             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                550  ,   /*H00_10 额定功率0.01KW                     */
                2080 ,   /*H00_11 额定电流   0.1a                    */
                3500 ,   /*H00_12 额定转矩  0.1nm                    */
                8760 ,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                3000 ,   /*H00_15 最大转速                           */
                10700,   /*H00_16 惯量 10 -6 kgm2                    */
                5    ,   /*H00_17 PMSM 电机极对数                    */
                99  ,   /*H00_18 定子电阻    mOh                    */
                228 ,   /*H00_19 定子电感  Lq mH                    */
                228 ,   /*H00_20 定子电感  Ld mH                    */
                11600,   /*H00_21 反电势系数                         */
                180  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                100  ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                800,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                350,    //H01_24 D轴电流环比例增益	 
                280,    //H01_25 D轴电流环积分补偿因子	 
                350,    //H01_27 Q轴电流环比例增益
                280,    //H01_28 Q轴电流环积分补偿因子
               1200,    //H01_52 性能优先模式D轴比例增益
                300,    //H01_53 性能优先模式D轴积分补偿因子
               1200,    //H01_54 性能优先模式Q轴比例增益
                300,    //H01_55 性能优先模式Q轴积分补偿因子
                                     
              /*SIT_H3ZAV 75c15cd*/
                  717,   /*H00_00 电机型号  RSVD   00007             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                750  ,   /*H00_10 额定功率0.01KW                     */
                2570 ,   /*H00_11 额定电流   0.1a                    */
                4800 ,   /*H00_12 额定转矩  0.1nm                    */
                11900,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                3000 ,   /*H00_15 最大转速                           */
                14100,   /*H00_16 惯量 10 -6 kgm2                    */
                5    ,   /*H00_17 PMSM 电机极对数                    */
                72  ,   /*H00_18 定子电阻    mOh                    */
                193 ,   /*H00_19 定子电感  Lq mH                    */
                193 ,   /*H00_20 定子电感  Ld mH                    */
                11500,   /*H00_21 反电势系数                         */
                200  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                100  ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                900,   //H01_23 Q轴反电势补偿因子 
                380,    //H01_24 D轴电流环比例增益	 
                400,    //H01_25 D轴电流环积分补偿因子	 
                380,    //H01_27 Q轴电流环比例增益
                400,    //H01_28 Q轴电流环积分补偿因子
               1400,    //H01_52 性能优先模式D轴比例增益
                300,    //H01_53 性能优先模式D轴积分补偿因子
               1400,    //H01_54 性能优先模式Q轴比例增益
                300,    //H01_55 性能优先模式Q轴积分补偿因子
};


//　00组:   汇川伺服电机
// V1系列                                //增加汇川V1系列电机参数数组  by 熊飞
const STR_MOTRORPARA Motor_Parameter_SIT_V1SV[MOTOR_NUMS_SIT_V1SV] = 
{      
//               /*SIT_V1 50A提供参数,暂无该款电机，只是规划在这里，如果设此型号，就会提示ER107*/
//                 300,   /*H00_00 电机型号  RSVD   00300             */
//                   0,   /*H00_09 电机电压  0-220V                   */
//                   5,   /*H00_10 额定功率  0.01KW                   */
//                  84,   /*H00_11 额定电流  0.01a                     */
//                  64,   /*H00_12 额定转矩  0.01nm                    */
//                 192,   /*H00_13 最大转矩  0.01nm                    */
//                3000,   /*H00_14 额定转速   1RPM                    */
//                3000,   /*H00_15 最大转速                           */
//                  16,   /*H00_16 惯量 10 -6 kgm2                    */
//                   4,   /*H00_17 PMSM 电机极对数                    */
//                1000,   /*H00_18 定子电阻    mOh            */
//                 300,   /*H00_19 定子电感  Lq mH            */
//                 300,   /*H00_20 定子电感  Ld mH            */
//                5400,   /*H00_21 反电势系数 0.01mV/rpm              */
//                  90,   /*H00_22 转矩系数  0.01N.M/A                */
//                 500,   /*H00_23 电气系数     暂不确定                      */
//                  50,   /*H00_24 机械系数     暂不确定                      */
//                   1,   /*H00_30      编码器选择                    */
//                2500,   /*H00_31      编码器线数                    */
//                   0,   /*H00_32     编码器线数 高                  */
//                1800,   /*H00_33     初始电角度                     */
//                1800,   /*H00_34    u 初始电角度                    */
//                1000,   //H01_22 D轴反电势补偿因子 
//                1000,   //H01_23 Q轴反电势补偿因子 
//                1000,   //H01_24 D轴电流环比例增益	 
//                200,    //H01_25 D轴电流环积分补偿因子	 
//                1000,   //H01_27 Q轴电流环比例增益
//                100,    //H01_28 Q轴电流环积分补偿因子
//                2000,   //H01_52 性能优先模式D轴比例增益
//                200,    //H01_53 性能优先模式D轴积分补偿因子
//                2000,   //H01_54 性能优先模式Q轴比例增益
//                100,    //H01_55 H01_55 性能优先模式Q轴积分补偿因子

//              /*SIT_V1 10B提供参数,暂无该款电机，只是规划在这里，如果设此型号，就会提示ER107*/
//                 301,   /*H00_00 电机型号  RSVD   00300             */
//                   0,   /*H00_09 电机电压  0-220V                   */
//                  10,   /*H00_10 额定功率  0.01KW                   */
//                 150,   /*H00_11 额定电流  0.01a                     */
//                 127,   /*H00_12 额定转矩  0.01nm                    */
//                 381,   /*H00_13 最大转矩  0.01nm                    */
//                3000,   /*H00_14 额定转速   1RPM                    */
//                3000,   /*H00_15 最大转速                           */
//                  27,   /*H00_16 惯量 10 -6 kgm2                    */
//                   4,   /*H00_17 PMSM 电机极对数                    */
//                1000,   /*H00_18 定子电阻    mOh            */
//                 300,   /*H00_19 定子电感  Lq mH            */
//                 300,   /*H00_20 定子电感  Ld mH            */
//                5820,   /*H00_21 反电势系数 0.01mV/rpm              */
//                  97,   /*H00_22 转矩系数  0.01N.M/A                */
//                 500,   /*H00_23 电气系数     暂不确定                      */
//                  50,   /*H00_24 机械系数     暂不确定                      */
//                   1,   /*H00_30      编码器选择                    */
//                2500,   /*H00_31      编码器线数                    */
//                   0,   /*H00_32     编码器线数                   */
//                1800,   /*H00_33     初始电角度                     */
//                1800,   /*H00_34    u 初始电角度                    */
//                1000,   //H01_22 D轴反电势补偿因子 
//                1000,   //H01_23 Q轴反电势补偿因子 
//                1000,   //H01_24 D轴电流环比例增益	 
//                200,    //H01_25 D轴电流环积分补偿因子	 
//                1000,   //H01_27 Q轴电流环比例增益
//                100,    //H01_28 Q轴电流环积分补偿因子
//                2000,   //H01_52 性能优先模式D轴比例增益
//                200,    //H01_53 性能优先模式D轴积分补偿因子
//                2000,   //H01_54 性能优先模式Q轴比例增益
//                100,    //H01_55 H01_55 性能优先模式Q轴积分补偿因子

//              /*SIT_V1 15B提供参数,暂无该款电机，只是规划在这里，如果设此型号，就会提示ER107*/
//                 302,   /*H00_00 电机型号  RSVD   00300             */
//                   0,   /*H00_09 电机电压  0-220V                   */
//                  15,   /*H00_10 额定功率  0.01KW                   */
//                 200,   /*H00_11 额定电流  0.01a                     */
//                 175,   /*H00_12 额定转矩  0.01nm                    */
//                 525,   /*H00_13 最大转矩  0.01nm                    */
//                3000,   /*H00_14 额定转速   1RPM                    */
//                3000,   /*H00_15 最大转速                           */
//                 104,   /*H00_16 惯量 10 -6 kgm2                    */
//                   4,   /*H00_17 PMSM 电机极对数                    */
//                1000,   /*H00_18 定子电阻    mOh           */
//                 300,   /*H00_19 定子电感  Lq mH            */
//                 300,   /*H00_20 定子电感  Ld mH            */
//                5940,   /*H00_21 反电势系数 0.01mV/rpm              */
//                  99,   /*H00_22 转矩系数  0.01N.M/A                */
//                 500,   /*H00_23 电气系数     暂不确定                      */
//                  50,   /*H00_24 机械系数     暂不确定                      */
//                   1,   /*H00_30      编码器选择                    */
//                2500,   /*H00_31      编码器线数                    */
//                   0,   /*H00_32     编码器线数 高                  */
//                1800,   /*H00_33     初始电角度                     */
//                1800,   /*H00_34    u 初始电角度                    */
//                1000,   //H01_22 D轴反电势补偿因子 
//                1000,   //H01_23 Q轴反电势补偿因子 
//                1000,   //H01_24 D轴电流环比例增益	 
//                200,    //H01_25 D轴电流环积分补偿因子	 
//                1000,   //H01_27 Q轴电流环比例增益
//                100,    //H01_28 Q轴电流环积分补偿因子
//                2000,   //H01_52 性能优先模式D轴比例增益
//                200,    //H01_53 性能优先模式D轴积分补偿因子
//                2000,   //H01_54 性能优先模式Q轴比例增益
//                100,    //H01_55 H01_55 性能优先模式Q轴积分补偿因子

               /*SIT_V1 20B提供参数*/
             303,   /*H00_00 电机型号  RSVD   00300             */
                   0,   /*H00_09 电机电压  0-220V                   */
                  20,   /*H00_10 额定功率  0.01KW                   */
                  84,   /*H00_11 额定电流  0.01a                     */
                  64,   /*H00_12 额定转矩  0.01nm                    */
                 192,   /*H00_13 最大转矩  0.01nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                3000,   /*H00_15 最大转速                           */
                  16,   /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                14100,   /*H00_18 定子电阻    mOh 暂不确定           */
                 1900,   /*H00_19 定子电感  Lq mH 暂不确定           */
                 1900,   /*H00_20 定子电感  Ld mH 暂不确定           */
                5400,   /*H00_21 反电势系数 0.01mV/rpm  暂不确定            */
                  90,   /*H00_22 转矩系数  0.01N.M/A                */
                 500,   /*H00_23 电气系数     暂不确定                      */
                  50,   /*H00_24 机械系数     暂不确定                      */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度    暂不确定                 */
                1800,   /*H00_34    u 初始电角度   暂不确定                 */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                439,    //H01_24 D轴电流环比例增益	 
                135,    //H01_25 D轴电流环积分补偿因子	 
                439,    //H01_27 Q轴电流环比例增益
                135,    //H01_28 Q轴电流环积分补偿因子
                439,    //H01_52 性能优先模式D轴比例增益
                135,    //H01_53 性能优先模式D轴积分补偿因子
                439,    //H01_54 性能优先模式Q轴比例增益
                135,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V1 40B提供参数*/
                 304,   /*H00_00 电机型号  RSVD   00300             */
                   0,   /*H00_09 电机电压  0-220V                   */
                  40,   /*H00_10 额定功率  0.01KW                   */
                 150,   /*H00_11 额定电流  0.01a                     */
                 127,   /*H00_12 额定转矩  0.01nm                    */
                 381,   /*H00_13 最大转矩  0.01nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                3000,   /*H00_15 最大转速                           */
                  27,   /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                7950,   /*H00_18 定子电阻    mOh 暂不确定           */
                1200,   /*H00_19 定子电感  Lq mH 暂不确定           */
                1200,   /*H00_20 定子电感  Ld mH 暂不确定           */
                5820,   /*H00_21 反电势系数 0.01mV/rpm  暂不确定            */
                  97,   /*H00_22 转矩系数  0.01N.M/A                */
                 500,   /*H00_23 电气系数     暂不确定                      */
                  50,   /*H00_24 机械系数     暂不确定                      */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数                   */
                1800,   /*H00_33     初始电角度    暂不确定                 */
                1800,   /*H00_34    u 初始电角度   暂不确定                 */
                //电流环参数继承212
                600,    //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                779,    //H01_24 D轴电流环比例增益	 
                151,    //H01_25 D轴电流环积分补偿因子	 
                779,    //H01_27 Q轴电流环比例增益
                151,    //H01_28 Q轴电流环积分补偿因子
                779,    //H01_52 性能优先模式D轴比例增益
                151,    //H01_53 性能优先模式D轴积分补偿因子
                779,    //H01_54 性能优先模式Q轴比例增益
                151,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V1 55B提供参数*/
                 305,   /*H00_00 电机型号  RSVD   00300             */
                   0,   /*H00_09 电机电压  0-220V                   */
                  55,   /*H00_10 额定功率  0.01KW                   */
                 200,   /*H00_11 额定电流  0.01a                     */
                 175,   /*H00_12 额定转矩  0.01nm                    */
                 525,   /*H00_13 最大转矩  0.01nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                3000,   /*H00_15 最大转速                           */
                 104,   /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                1000,   /*H00_18 定子电阻    mOh 暂不确定           */
                 300,   /*H00_19 定子电感  Lq mH 暂不确定           */
                 300,   /*H00_20 定子电感  Ld mH 暂不确定           */
                5940,   /*H00_21 反电势系数 0.01mV/rpm  暂不确定            */
                  99,   /*H00_22 转矩系数  0.01N.M/A                */
                 500,   /*H00_23 电气系数     暂不确定                      */
                  50,   /*H00_24 机械系数     暂不确定                      */
                   1,   /*H00_30      编码器选择                    */
                2500,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度    暂不确定                 */
                1800,   /*H00_34    u 初始电角度   暂不确定                 */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1169,   //H01_24 D轴电流环比例增益	 
                300,    //H01_25 D轴电流环积分补偿因子	 
                1169,   //H01_27 Q轴电流环比例增益
                300,    //H01_28 Q轴电流环积分补偿因子
                1169,   //H01_52 性能优先模式D轴比例增益
                300,    //H01_53 性能优先模式D轴积分补偿因子
                1169,   //H01_54 性能优先模式Q轴比例增益
                300,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V1 75B提供参数*/
                   306,  /*H00_00 电机型号  RSVD   00301             */
                     0,   /*H00_09 电机电压  0-220V                   */
                    75,  /*H00_10 额定功率0.01KW                     */
                   260,  /*H00_11 额定电流   0.01a                    */
                   239,  /*H00_12 额定转矩  0.01nm                    */
                   717,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                   130,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  3500,  /*H00_18 定子电阻    mOh                    */
                  1100,  /*H00_19 定子电感  Lq mH                    */
                  1100,  /*H00_20 定子电感  Ld mH                    */
                  6120,  /*H00_21 反电势系数   0.01mV/rpm            */
                   102,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度      暂不确定       */
                  1800,  /*H00_34    u 初始电角度     暂不确定       */
                //电流环参数继承212
                200,    //H01_22 D轴反电势补偿因子 
                950,    //H01_23 Q轴反电势补偿因子 
                490,    //H01_24 D轴电流环比例增益	 
                236,    //H01_25 D轴电流环积分补偿因子	 
                490,    //H01_27 Q轴电流环比例增益
                236,    //H01_28 Q轴电流环积分补偿因子
                490,    //H01_52 性能优先模式D轴比例增益
                236,    //H01_53 性能优先模式D轴积分补偿因子
                490,    //H01_54 性能优先模式Q轴比例增益
                236,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V1 10C提供参数*/
                   307,  /*H00_00 电机型号  RSVD   00301             */
                     0,   /*H00_09 电机电压  0-220V                   */
                   100,  /*H00_10 额定功率0.01KW                     */
                   420,  /*H00_11 额定电流   0.01a                    */
                   318,  /*H00_12 额定转矩  0.01nm                    */
                   954,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                   170,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  1900,  /*H00_18 定子电阻    mOh                    */
                   525,  /*H00_19 定子电感  Lq mH                    */
                   525,  /*H00_20 定子电感  Ld mH                    */
                  5280,  /*H00_21 反电势系数   0.01mV/rpm            */
                    88,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度      暂不确定       */
                  1800,  /*H00_34    u 初始电角度     暂不确定       */
                //电流环参数 20140510               
                 500,   //H01_22 D轴反电势补偿因子 
                 600,   //H01_23 Q轴反电势补偿因子 
                 500,   //H01_24 D轴电流环比例增益	 
                 180,   //H01_25 D轴电流环积分补偿因子	 
                 500,   //H01_27 Q轴电流环比例增益
                 180,   //H01_28 Q轴电流环积分补偿因子
                1500,   //H01_52 性能优先模式D轴比例增益
                 200,   //H01_53 性能优先模式D轴积分补偿因子
                1500,   //H01_54 性能优先模式Q轴比例增益
                 200,   //H01_55 性能优先模式Q轴积分补偿因子
 };

// 汇川 V2系列
const STR_MOTRORPARA Motor_Parameter_SIT_V2SV[MOTOR_NUMS_SIT_V2SV] =
{
              /*SIT_V2 10C30CD*/
                   400,  /*H00_00 电机型号  RSVD   00301             */
                     1,   /*H00_09 电机电压  0-220V                   */
                   100,  /*H00_10 额定功率0.01KW                     */
                   260,  /*H00_11 额定电流   0.01a                    */
                   318,  /*H00_12 额定转矩  0.01nm                    */
                   954,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                  187,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  4190,  /*H00_18 定子电阻    mOh                    */
                  1346,  /*H00_19 定子电感  Lq mH                    */
                  1346,  /*H00_20 定子电感  Ld mH                    */
                  8000,  /*H00_21 反电势系数   0.01mV/rpm            */
                   122,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度                     */
                  1800,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                349,    //H01_24 D轴电流环比例增益	 
                321,    //H01_25 D轴电流环积分补偿因子	 
                349,    //H01_27 Q轴电流环比例增益
                321,    //H01_28 Q轴电流环积分补偿因子
                349,    //H01_52 性能优先模式D轴比例增益
                321,    //H01_53 性能优先模式D轴积分补偿因子
                349,    //H01_54 性能优先模式Q轴比例增益
                321,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V2 15C30CD*/
                   401,  /*H00_00 电机型号  RSVD   00301             */
                     1,   /*H00_09 电机电压  0-220V                   */
                   150,  /*H00_10 额定功率0.01KW                     */
                   330,  /*H00_11 额定电流   0.01a                    */
                   490,  /*H00_12 额定转矩  0.01nm                    */
                   1470,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                  246,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  3980,  /*H00_18 定子电阻    mOh                    */
                  1274,  /*H00_19 定子电感  Lq mH                    */
                  1274,  /*H00_20 定子电感  Ld mH                    */
                  9700,  /*H00_21 反电势系数   0.01mV/rpm            */
                   148,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度                     */
                  1800,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                291,    //H01_24 D轴电流环比例增益	 
                320,    //H01_25 D轴电流环积分补偿因子	 
                291,    //H01_27 Q轴电流环比例增益
                320,    //H01_28 Q轴电流环积分补偿因子
                291,    //H01_52 性能优先模式D轴比例增益
                320,    //H01_53 性能优先模式D轴积分补偿因子
                291,    //H01_54 性能优先模式Q轴比例增益
                320,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V2 20C30CD*/
                   402,  /*H00_00 电机型号  RSVD   00301             */
                     1,   /*H00_09 电机电压  0-220V                   */
                   200,  /*H00_10 额定功率0.01KW                     */
                   450,  /*H00_11 额定电流   0.01a                    */
                   636,  /*H00_12 额定转矩  0.01nm                    */
                  1908,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                  305,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  2520,  /*H00_18 定子电阻    mOh                    */
                   952,  /*H00_19 定子电感  Lq mH                    */
                   952,  /*H00_20 定子电感  Ld mH                    */
                  9700,  /*H00_21 反电势系数   0.01mV/rpm            */
                   140,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度                     */
                  1800,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                285,    //H01_24 D轴电流环比例增益	 
                189,    //H01_25 D轴电流环积分补偿因子	 
                285,    //H01_27 Q轴电流环比例增益
                189,    //H01_28 Q轴电流环积分补偿因子
                285,    //H01_52 性能优先模式D轴比例增益
                189,    //H01_53 性能优先模式D轴积分补偿因子
                285,    //H01_54 性能优先模式Q轴比例增益
                189,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V2 25C30CD提供参数*/
                   403,  /*H00_00 电机型号  RSVD   00301             */
                     1,   /*H00_09 电机电压  0-220V                   */
                   250,  /*H00_10 额定功率0.01KW                     */
                   530,  /*H00_11 额定电流   0.01a                    */
                   796,  /*H00_12 额定转矩  0.01nm                    */
                   2388,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                  365,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  2050,  /*H00_18 定子电阻    mOh                    */
                   765,  /*H00_19 定子电感  Lq mH                    */
                   765,  /*H00_20 定子电感  Ld mH                    */
                  9700,  /*H00_21 反电势系数   0.01mV/rpm            */
                   150,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度                     */
                  1800,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                301,    //H01_24 D轴电流环比例增益	 
                187,    //H01_25 D轴电流环积分补偿因子	 
                301,    //H01_27 Q轴电流环比例增益
                187,    //H01_28 Q轴电流环积分补偿因子
                301,    //H01_52 性能优先模式D轴比例增益
                187,    //H01_53 性能优先模式D轴积分补偿因子
                301,    //H01_54 性能优先模式Q轴比例增益
                187,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V2 30C30CD*/
                   404,  /*H00_00 电机型号  RSVD   00301             */
                     1,   /*H00_09 电机电压  0-220V                   */
                   300,  /*H00_10 额定功率0.01KW                     */
                   750,  /*H00_11 额定电流   0.01a                    */
                   980,  /*H00_12 额定转矩  0.01nm                    */
                   2940,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                  801,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                  1600,  /*H00_18 定子电阻    mOh                    */
                  1000,  /*H00_19 定子电感  Lq mH                    */
                  1000,  /*H00_20 定子电感  Ld mH                    */
                  10000,  /*H00_21 反电势系数   0.01mV/rpm            */
                   131,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度                     */
                  1800,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                850,    //H01_23 Q轴反电势补偿因子 
                407,    //H01_24 D轴电流环比例增益	 
                188,    //H01_25 D轴电流环积分补偿因子	 
                407,    //H01_27 Q轴电流环比例增益
                188,    //H01_28 Q轴电流环积分补偿因子
                407,    //H01_52 性能优先模式D轴比例增益
                188,    //H01_53 性能优先模式D轴积分补偿因子
                407,    //H01_54 性能优先模式Q轴比例增益
                188,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V2 40C30CD提供参数*/
                   405,  /*H00_00 电机型号  RSVD   00301             */
                     1,   /*H00_09 电机电压  0-220V                   */
                   400,  /*H00_10 额定功率0.01KW                     */
                   900,  /*H00_11 额定电流   0.01a                    */
                   1260,  /*H00_12 额定转矩  0.01nm                    */
                   3780,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                  1210,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                   700,  /*H00_18 定子电阻    mOh                    */
                   443,  /*H00_19 定子电感  Lq mH                    */
                   443,  /*H00_20 定子电感  Ld mH                    */
                  10000,  /*H00_21 反电势系数   0.01mV/rpm            */
                   140,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度                     */
                  1800,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                500,    //H01_22 D轴反电势补偿因子 
                1300,   //H01_23 Q轴反电势补偿因子 
                552,    //H01_24 D轴电流环比例增益	 
                229,    //H01_25 D轴电流环积分补偿因子	 
                552,    //H01_27 Q轴电流环比例增益
                229,    //H01_28 Q轴电流环积分补偿因子
                552,    //H01_52 性能优先模式D轴比例增益
                229,    //H01_53 性能优先模式D轴积分补偿因子
                552,    //H01_54 性能优先模式Q轴比例增益
                229,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V2 50C30CD提供参数,暂无该款电机，只是规划在这里，如果设此型号，就会提示ER107*/
                   406,  /*H00_00 电机型号  RSVD   00301             */
                     1,   /*H00_09 电机电压  0-220V                   */
                   500,  /*H00_10 额定功率0.01KW                     */
                   1050,  /*H00_11 额定电流   0.01a                    */
                   1580,  /*H00_12 额定转矩  0.01nm                    */
                   4740,  /*H00_13 最大转矩  0.01nm                    */
                  3000,  /*H00_14 额定转速   1RPM                    */
                  3000,  /*H00_15 最大转速                           */
                  1540,  /*H00_16 惯量 10 -6 kgm2                    */
                     4,  /*H00_17 PMSM 电机极对数                    */
                   660,  /*H00_18 定子电阻    mOh                    */
                   400,  /*H00_19 定子电感  Lq mH                    */
                   400,  /*H00_20 定子电感  Ld mH                    */
                  10000,  /*H00_21 反电势系数   0.01mV/rpm            */
                   150,  /*H00_22 转矩系数     0.01N.M/A             */
                   500,  /*H00_23 电气系数      暂不确定                     */
                    50,  /*H00_24 机械系数      暂不确定                     */
                     1,  /*H00_30      编码器选择                    */
                  2500,  /*H00_31      编码器线数                    */
                     0,  /*H00_32     编码器线数 高                  */
                  1800,  /*H00_33     初始电角度                     */
                  1800,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                291,    //H01_24 D轴电流环比例增益	 
                300,    //H01_25 D轴电流环积分补偿因子	 
                291,    //H01_27 Q轴电流环比例增益
                303,    //H01_28 Q轴电流环积分补偿因子
                291,    //H01_52 性能优先模式D轴比例增益
                303,    //H01_53 性能优先模式D轴积分补偿因子
                291,    //H01_54 性能优先模式Q轴比例增益
                303,    //H01_55 性能优先模式Q轴积分补偿因子
 };

//　00组:   汇川高响应伺服电机
//  500系列: V3系列
const STR_MOTRORPARA Motor_Parameter_SIT_V3SV[MOTOR_NUMS_SIT_V3SV] = 
{
             /*SIT_V3AV 45b15CD 参数*/
                 510,   /*H00_00 电机型号  RSVD   00000             */
              1    ,   /*H00_09 电机电压  0-220V                   */
              45   ,   /*H00_10 额定功率0.01KW                     */
              100  ,   /*H00_11 额定电流   0.1a                    */
              287  ,   /*H00_12 额定转矩  0.1nm                    */
              720  ,   /*H00_13 最大转矩  0.1nm                    */
              1500 ,   /*H00_14 额定转速   1RPM                    */
              1500 ,   /*H00_15 最大转速                           */
              685  ,   /*H00_16 惯量 10 -6 kgm2                    */
              4    ,   /*H00_17 PMSM 电机极对数                    */
              39000,   /*H00_18 定子电阻    mOh                    */
              8320 ,   /*H00_19 定子电感  Lq mH                    */
              8320 ,   /*H00_20 定子电感  Ld mH                    */
              20000,   /*H00_21 反电势系数                         */
              287  ,   /*H00_22 转矩系数                           */
              500  ,   /*H00_23 电气系数                           */
              50   ,   /*H00_24 机械系数                           */
              1    ,   /*H00_30      编码器选择                    */
              2500 ,   /*H00_31      编码器线数                    */
              0    ,   /*H00_32     编码器线数 高                  */
              1800 ,   /*H00_33     初始电角度                     */
              1800 ,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                147,    //H01_24 D轴电流环比例增益	 
                213,    //H01_25 D轴电流环积分补偿因子	 
                147,    //H01_27 Q轴电流环比例增益
                213,    //H01_28 Q轴电流环积分补偿因子
                147,    //H01_52 性能优先模式D轴比例增益
                213,    //H01_53 性能优先模式D轴积分补偿因子
                147,    //H01_54 性能优先模式Q轴比例增益
                213,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V3AV 85b15cd提供参数*/
                  511,  /*H00_00 电机型号  RSVD   00001             */
                  1    ,   /*H00_09 电机电压  0-220V                  */
                  85   ,  /*H00_10 额定功率0.01KW                     */
                  160  ,  /*H00_11 额定电流   0.1a                    */
                  539  ,  /*H00_12 额定转矩  0.1nm                    */
                  1350 ,  /*H00_13 最大转矩  0.1nm                    */
                  1500 ,  /*H00_14 额定转速   1RPM                    */
                  1500 ,  /*H00_15 最大转速                           */
                  1300 ,  /*H00_16 惯量 10 -6 kgm2                    */
                  4    ,  /*H00_17 PMSM 电机极对数                    */
                  14800,  /*H00_18 定子电阻    mOh                    */
                  4160 ,  /*H00_19 定子电感  Lq mH                    */
                  4160 ,  /*H00_20 定子电感  Ld mH                    */
                  20000,  /*H00_21 反电势系数                         */
                  337  ,  /*H00_22 转矩系数                           */
                  500  ,  /*H00_23 电气系数                           */
                  50   ,  /*H00_24 机械系数                           */
                  1    ,  /*H00_30      编码器选择                    */
                  2500 ,  /*H00_31      编码器线数                    */
                  0    ,  /*H00_32     编码器线数 高                  */
                  1800 ,  /*H00_33     初始电角度                     */
                  1800 ,  /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                184,    //H01_24 D轴电流环比例增益	 
                281,    //H01_25 D轴电流环积分补偿因子	 
                184,    //H01_27 Q轴电流环比例增益
                281,    //H01_28 Q轴电流环积分补偿因子
                184,    //H01_52 性能优先模式D轴比例增益
                281,    //H01_53 性能优先模式D轴积分补偿因子
                184,    //H01_54 性能优先模式Q轴比例增益
                281,    //H01_55 性能优先模式Q轴积分补偿因子

              /*SIT_V3AV 13c15cd参数*/
                 512,   /*H00_00 电机型号  RSVD   00002             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 130  ,   /*H00_10 额定功率0.01KW                     */
                 250  ,   /*H00_11 额定电流   0.1a                    */
                 834  ,   /*H00_12 额定转矩  0.1nm                    */
                 2085 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 1500 ,   /*H00_15 最大转速                           */
                 1930 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 4    ,   /*H00_17 PMSM 电机极对数                    */
                 9360 ,   /*H00_18 定子电阻    mOh                    */
                 2720 ,   /*H00_19 定子电感  Lq mH                    */
                 2720 ,   /*H00_20 定子电感  Ld mH                    */
                 20000,   /*H00_21 反电势系数                         */
                 334  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 50   ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,   /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                180,    //H01_24 D轴电流环比例增益	 
                291,    //H01_25 D轴电流环积分补偿因子	 
                180,    //H01_27 Q轴电流环比例增益
                291,    //H01_28 Q轴电流环积分补偿因子
                180,    //H01_52 性能优先模式D轴比例增益
                291,    //H01_53 性能优先模式D轴积分补偿因子
                180,    //H01_54 性能优先模式Q轴比例增益
                291,    //H01_55 性能优先模式Q轴积分补偿因子
                    
              /*SIT_V3AV 18c15cd参数*/
                 513,   /*H00_00 电机型号  RSVD   00003             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 180  ,   /*H00_10 额定功率0.01KW                     */
                 330  ,   /*H00_11 额定电流   0.1a                    */
                 1150 ,   /*H00_12 额定转矩  0.1nm                    */
                 2875 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 1500 ,   /*H00_15 最大转速                           */
                 2550 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 4    ,   /*H00_17 PMSM 电机极对数                    */
                 6520 ,   /*H00_18 定子电阻    mOh                    */
                 2080 ,   /*H00_19 定子电感  Lq mH                    */
                 2080 ,   /*H00_20 定子电感  Ld mH                    */
                 20000,   /*H00_21 反电势系数                         */
                 348  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 50   ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                178,    //H01_24 D轴电流环比例增益	 
                160,    //H01_25 D轴电流环积分补偿因子	 
                178,    //H01_27 Q轴电流环比例增益
                160,    //H01_28 Q轴电流环积分补偿因子
                178,    //H01_52 性能优先模式D轴比例增益
                160,    //H01_53 性能优先模式D轴积分补偿因子
                178,    //H01_54 性能优先模式Q轴比例增益
                160,    //H01_55 性能优先模式Q轴积分补偿因子
                                     
              /*SIT_V3AV 29c15cd*/
                 514,   /*H00_00 电机型号  RSVD   00004             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 290  ,   /*H00_10 额定功率0.01KW                     */
                 840  ,   /*H00_11 额定电流   0.1a                    */
                 1860 ,   /*H00_12 额定转矩  0.1nm                    */
                 4510 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 1500 ,   /*H00_15 最大转速                           */
                 5500 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 4    ,   /*H00_17 PMSM 电机极对数                    */
                 350 ,   /*H00_18 定电阻    mOh                    */
                 720 ,   /*H00_19 定子电感  Lq mH                    */
                 720 ,   /*H00_20 定子电感  Ld mH                    */
                 14500,   /*H00_21 反电势系数                         */
                 221  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 50   ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                404,    //H01_24 D轴电流环比例增益	 
                411,    //H01_25 D轴电流环积分补偿因子	 
                404,    //H01_27 Q轴电流环比例增益
                411,    //H01_28 Q轴电流环积分补偿因子
                404,    //H01_52 性能优先模式D轴比例增益
                411,    //H01_53 性能优先模式D轴积分补偿因子
                404,    //H01_54 性能优先模式Q轴比例增益
                411,    //H01_55 性能优先模式Q轴积分补偿因子
                                    
              /*SIT_V3AV 44c15cd*/
                515,   /*H00_00 电机型号  RSVD   00005             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                440  ,   /*H00_10 额定功率0.01KW                     */
                1163 ,   /*H00_11 额定电流   0.1a                    */
                2840 ,   /*H00_12 额定转矩  0.1nm                    */
                7110 ,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                1500 ,   /*H00_15 最大转速                           */
                8890 ,   /*H00_16 惯量 10 -6 kgm2 //2010-12-06 xiongfei                  */
                4    ,   /*H00_17 PMSM 电机极对数                    */
                250  ,   /*H00_18 定子电阻    mOh                    */
                590 ,   /*H00_19 定子电感  Lq mH                    */
                590 ,   /*H00_20 定子电感  Ld mH                    */
                14800,   /*H00_21 反电势系数                         */
                244  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                50   ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                392,    //H01_24 D轴电流环比例增益	 
                429,    //H01_25 D轴电流环积分补偿因子	 
                392,    //H01_27 Q轴电流环比例增益
                429,    //H01_28 Q轴电流环积分补偿因子
                392,    //H01_52 性能优先模式D轴比例增益
                429,    //H01_53 性能优先模式D轴积分补偿因子
                392,    //H01_54 性能优先模式Q轴比例增益
                429,    //H01_55 性能优先模式Q轴积分补偿因子
                                     
              /*SIT_V3AV 55c15cd*/
                516,   /*H00_00 电机型号  RSVD   00006             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                550  ,   /*H00_10 额定功率0.01KW                     */
                1456 ,   /*H00_11 额定电流   0.1a                    */
                3500 ,   /*H00_12 额定转矩  0.1nm                    */
                8760 ,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                1500 ,   /*H00_15 最大转速                           */
                10700,   /*H00_16 惯量 10 -6 kgm2                    */
                4    ,   /*H00_17 PMSM 电机极对数                    */
                190  ,   /*H00_18 定子电阻    mOh                    */
                360 ,   /*H00_19 定子电感  Lq mH                    */
                360 ,   /*H00_20 定子电感  Ld mH                    */
                15600,   /*H00_21 反电势系数                         */
                240  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                50   ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                900,    //H01_23 Q轴反电势补偿因子 
                466,    //H01_24 D轴电流环比例增益	 
                332,    //H01_25 D轴电流环积分补偿因子	 
                466,    //H01_27 Q轴电流环比例增益
                332,    //H01_28 Q轴电流环积分补偿因子
                466,    //H01_52 性能优先模式D轴比例增益
                332,    //H01_53 性能优先模式D轴积分补偿因子
                466,    //H01_54 性能优先模式Q轴比例增益
                332,    //H01_55 性能优先模式Q轴积分补偿因子
                                     
              /*SIT_V3AV 75c15cd*/
                517,   /*H00_00 电机型号  RSVD   00007             */
                1    ,   /*H00_09 电机电压  0-220V                   */
                750  ,   /*H00_10 额定功率0.01KW                     */
                1810 ,   /*H00_11 额定电流   0.1a                    */
                4800 ,   /*H00_12 额定转矩  0.1nm                    */
                11900,   /*H00_13 最大转矩  0.1nm                    */
                1500 ,   /*H00_14 额定转速   1RPM                    */
                1500 ,   /*H00_15 最大转速                           */
                14100,   /*H00_16 惯量 10 -6 kgm2                    */
                4    ,   /*H00_17 PMSM 电机极对数                    */
                160  ,   /*H00_18 定子电阻    mOh                    */
                350 ,   /*H00_19 定子电感  Lq mH                    */
                350 ,   /*H00_20 定子电感  Ld mH                    */
                15300,   /*H00_21 反电势系数                         */
                265  ,   /*H00_22 转矩系数                           */
                500  ,   /*H00_23 电气系数                           */
                50   ,   /*H00_24 机械系数                           */
                1    ,   /*H00_30      编码器选择                    */
                2500 ,   /*H00_31      编码器线数                    */
                0    ,   /*H00_32     编码器线数 高                  */
                1800 ,   /*H00_33     初始电角度                     */
                1800 ,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                386,    //H01_24 D轴电流环比例增益	 
                273,    //H01_25 D轴电流环积分补偿因子	 
                386,    //H01_27 Q轴电流环比例增益
                273,    //H01_28 Q轴电流环积分补偿因子
                386,    //H01_52 性能优先模式D轴比例增益
                273,    //H01_53 性能优先模式D轴积分补偿因子
                386,    //H01_54 性能优先模式Q轴比例增益
                273,    //H01_55 性能优先模式Q轴积分补偿因子    
                
              /*SIT_H3AV 13c15cd参数  铭牌改成V3-18C15CB*/
                 521,     /*H00_00 电机型号  RSVD   00002             */
                 1    ,   /*H00_09 电机电压  0-220V                   */
                 130  ,   /*H00_10 额定功率0.01KW                     */
                 660  ,   /*H00_11 额定电流   0.1a                    */
                 1150 ,   /*H00_12 额定转矩  0.1nm                    */
                 2875 ,   /*H00_13 最大转矩  0.1nm                    */
                 1500 ,   /*H00_14 额定转速   1RPM                    */
                 3000 ,   /*H00_15 最大转速                           */
                 1930 ,   /*H00_16 惯量 10 -6 kgm2                    */
                 4    ,   /*H00_17 PMSM 电机极对数                    */
                 2380 ,   /*H00_18 定子电阻    mOh                    */
                 680  ,   /*H00_19 定子电感  Lq mH                    */
                 680  ,   /*H00_20 定子电感  Ld mH                    */
                 10000,   /*H00_21 反电势系数                         */
                 178  ,   /*H00_22 转矩系数                           */
                 500  ,   /*H00_23 电气系数                           */
                 100  ,   /*H00_24 机械系数                           */
                 1    ,   /*H00_30      编码器选择                    */
                 2500 ,   /*H00_31      编码器线数                    */
                 0    ,   /*H00_32     编码器线数 高                  */
                 1800 ,   /*H00_33     初始电角度                     */
                 1800 ,   /*H00_34    u 初始电角度                     */
                //电流环参数    20131106修改
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                650,    //H01_24 D轴电流环比例增益	 
                70,    //H01_25 D轴电流环积分补偿因子	 
                650,    //H01_27 Q轴电流环比例增益
                70,     //H01_28 Q轴电流环积分补偿因子
                1800,   //H01_52 性能优先模式D轴比例增益
                40,     //H01_53 性能优先模式D轴积分补偿因子
                1800,   //H01_54 性能优先模式Q轴比例增益
                40,     //H01_55 性能优先模式Q轴积分补偿因子                                
};


//10组 三洋电机
//100系列 P5系列
const STR_MOTRORPARA Motor_Parameter_SANYO_P5[MOTOR_NUMS_SANYO_P5] = 
{              /*SANYO P50B07040HXS */
                10000,   /*H00_00 电机型号  RSVD   10000             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   40,   /*H00_10 额定功率0.01KW                     */
                  210,   /*H00_11 额定电流   0.1a                    */
                  127,   /*H00_12 额定转矩  0.1nm                    */
                  392,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 3000,   /*H00_15 最大转速                           */
                  74,   /*H00_16 惯量 10 -6 kgm2                    */
                    2,   /*H00_17 PMSM 电机极对数                    */
                 3400,   /*H00_18 定子电阻    mOh                    */
                    1,   /*H00_19 定子电感  Lq mH                    */
                    1,   /*H00_20 定子电感  Ld mH                    */
                 4157,   /*H00_21 反电势系数                         */
                   74,   /*H00_22 转矩系数                           */
                  400,   /*H00_23 电气系数                           */
                  170,   /*H00_24 机械系数                           */
                0x101,   /*H00_30      编码器选择                    */
                 2000,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                  600,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子
                                    
              /*SANYO P50B08075HXS*/
                10001,   /*H00_00 电机型号  RSVD   10001             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   75,   /*H00_10 额定功率0.01KW                     */
                  390,   /*H00_11 额l定电流   0.1a                    */
                  238,   /*H00_12 额定转矩  0.1nm                    */
                  882,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 3000,   /*H00_15 最大转速                           */
                 192,   /*H00_16 惯 10 -6 kgm2                    */
                    2,   /*H00_17 PMSM 电机极对数                    */
                 1070,   /*H00_18 定子电阻    mOh                    */
                    1,   /*H00_19 定子电感  Lq mH                    */
                    1,   /*H00_20 定子电感  Ld mH                    */
                 4166,   /*H00_21 反电势系数                         */
                   69,   /*H00_22 转矩系数                           */
                  530,   /*H00_23 电气系数                           */
                  130,   /*H00_24 机械系数                           */
                0x101,   /*H00_30      编码器选择                    */
                 2000,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                  600,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子
                                    
                /*SANYO P50B08100HXS*/
                10002,   /*H00_00 电机型号  RSVD   10002             */
                    0,   /*H00_09 电机电压  0-220V                   */
                  100,   /*H00_10 额定功率0.01KW                     */
                  430,   /*H00_11 额l定电流   0.1a                    */
                  319,   /*H00_12 额定转矩  0.1nm                    */
                  882,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 3000,   /*H00_15 最大转速                           */
                 265,   /*H00_16 惯量 10 -6 kgm2                    */
                    2,   /*H00_17 PMSM 电机极对数                    */
                 1000,   /*H00_18 定子电阻    mOh                    */
                    1,   /*H00_19 定子电感  Lq mH                    */
                    1,   /*H00_20 定子电感  Ld mH                    */
                 5200,   /*H00_21 反电势系数                         */
                   86,   /*H00_22 转矩系数                           */
                  590,   /*H00_23 电气系数                           */
                  110,   /*H00_24 机械系数                           */
                0x101,   /*H00_30      编码器选择                    */
                 2000,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                  600,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子                    
};

const STR_MOTRORPARA Motor_Parameter_SANYO_P3[MOTOR_NUMS_SANYO_P3] =
{              /*SANYO P30B06040DXS */
                10100,   /*H00_00 电机型号  RSVD   10100             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   40,   /*H00_10 额定功率0.01KW                     */
                  270,   /*H00_11 额定电流   0.1a                    */
                  127,   /*H00_12 额定转矩  0.1nm                    */
                  382,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 4500,   /*H00_15 最大转速                           */
                  26,   /*H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                 1400,   /*H00_18 定子电阻    mOh                    */
                    1,   /*H00_19 定子电感  Lq mH                    */
                    1,   /*H00_20 定子电感  Ld mH                    */
                 3222,   /*H00_21 反电势系数                         */
                   53,   /*H00_22 转矩系数                           */
                  460,   /*H00_23 电气系数                           */
                   38,   /*H00_24 机械系数                           */
                0x101,   /*H00_30      编码器选择                    */
                 2000,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                  600,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子
                                    
                /*SANYO P30B06075DXS    */
                10101,   /*H00_00 电机型号  RSVD   10101             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   75,   /*H00_10 额定功率0.01KW                     */
                  460,   /*H00_11 额定电流   0.1a                    */
                  238,   /*H00_12 额定转矩  0.1nm                    */
                  715,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额定转速   1RPM                    */
                 4500,   /*H00_15 最大转速                           */
                  64,   /*H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                  520,   /*H00_18 定子电阻    mOh                    */
                    1,   /*H00_19 定子电感  Lq mH                    */
                    1,   /*H00_20 定子电感  Ld mH                    */
                 3419,   /*H00_21 反电势系数                         */
                   57,   /*H00_22 转矩系数                           */
                  830,   /*H00_23 电气系数                           */
                   30,   /*H00_24 机械系数                           */
                0x101,   /*H00_30      编码器选择                    */
                 2000,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                  600,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子                     
};

const STR_MOTRORPARA Motor_Parameter_MECAPION_S0[MOTOR_NUMS_MECAPION_0] = 
{              /*MECAPION APM-SAR5A 50w */
               11000,   /*H00_00 电机型号  RSVD   11000             */
                   0,   /*H00_09 电机电压  0-220V                   */
                   5,   /*H00_10 额定功率0.01KW                     */
                  70,   /*H00_11 额定电流   0.1a                    */
                  16,   /*H00_12 额定转矩  0.1nm                    */
                  48,   /*H00_13 最大转矩  0.1nm                    */
                3000,   /*H00_14 额定转速   1RPM                    */
                5000,   /*H00_15 最大转速                           */
                   2,   /*H00_16 惯量 10 -6 kgm2                    */
                   4,   /*H00_17 PMSM 电机极对数                    */
                3500,   /*H00_18 定子电阻    mOh                    */
                 500,   /*H00_19 定子电感  Lq mH                    */
                 500,   /*H00_20 定子电感  Ld mH                    */
                1500,   /*H00_21 反电势系数                         */
                  23,   /*H00_22 转矩系数                           */
                 685,   /*H00_23 电气系数                           */
                  35,   /*H00_24 机械系数                           */
                0x500,   /*H00_30      编码器选择                    */
                2048,   /*H00_31      编码器线数                    */
                   0,   /*H00_32     编码器线数 高                  */
                1800,   /*H00_33     初始电角度                     */
                1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子
                                   
                /*MECAPION APM-SA01A 100W   */
                11001,   /*H00_00 电机型号  RSVD   11001             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   10,   /*H00_10 额定功率0.01KW                     */
                  138,   /*H00_11 额定电流   0.1a                    */
                   32,   /*H00_12 额定转矩  0.1nm                    */
                   96,   /*H00_13 最大转矩  0.1nm                    */
                 3000,   /*H00_14 额ㄗ?  1RPM                    */
                 5000,   /*H00_15 最大转速                           */
                    5,   /*H00_16 惯量 10 -6 kgm2                    */
                    4,   /*H00_17 PMSM 电机极对数                    */
                 3500,   /*H00_18 定子电阻    mOh                    */
                  500,   /*H00_19 定子电感  Lq mH                    */
                  500,   /*H00_20 定子电感  Ld mH                    */
                 1500,   /*H00_21 反电势系数                         */
                   23,   /*H00_22 转矩系数                           */
                  685,   /*H00_23 电气系数                           */
                   35,   /*H00_24 机械系数                           */
                 0x500,   /*H00_30      编码器选择                    */
                 2048,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,   /*H00_34    u 初始电角度                    */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子                     
};

const STR_MOTRORPARA Motor_Parameter_GOLDENAGE_S0[MOTOR_NUMS_GOLDENAGE_0] = 
{              /* GK6060-6AC31  */
                12000,   /*H00_00 电机型号  RSVD   12000             */
                    0,   /*H00_09 电机电压  0-220V                   */
                   75,   /*H00_10 额定功率0.01KW                     */
                  250,   /*H00_11 额定电流   0.1a                    */
                  300,   /*H00_12 额定转矩  0.1nm                    */
                  900,   /*H00_13 最大转矩  0.1nm                    */
                 2000,   /*H00_14 额定转速   1RPM                    */
                 2500,   /*H00_15 最大转速                           */
                 440,   /*H00_16 惯量 10 -6 kgm2                    */
                    3,   /*H00_17 PMSM 电机极对数                    */
                  300,   /*H00_18 定子电阻    mOh                    */
                  100,   /*H00_19 定子电感  Lq mH                    */
                  100,   /*H00_20 定子电感  Ld mH                    */
                 7593,   /*H00_21 反电势系数                         */
                  120,   /*H00_22 转矩系数                           */
                  675,   /*H00_23 电气系数                           */
                   30,   /*H00_24 机械系数                           */
                 0x500,   /*H00_30      编码器选择                    */
                 2500,   /*H00_31      编码器线数                    */
                    0,   /*H00_32     编码器线数 高                  */
                 1800,   /*H00_33     初始电角度                     */
                 1800,  /*H00_34    u 初始电角度                     */
                //电流环参数继承212
                1000,   //H01_22 D轴反电势补偿因子 
                1000,   //H01_23 Q轴反电势补偿因子 
                1000,   //H01_24 D轴电流环比例增益	 
                200,    //H01_25 D轴电流环积分补偿因子	 
                1000,   //H01_27 Q轴电流环比例增益
                100,    //H01_28 Q轴电流环积分补偿因子
                2000,   //H01_52 性能优先模式D轴比例增益
                200,    //H01_53 性能优先模式D轴积分补偿因子
                2000,   //H01_54 性能优先模式Q轴比例增益
                100,    //H01_55 性能优先模式Q轴积分补偿因子
};

/* Private_Variables ---------------------------------------------------------*/
/* 变量定义 */
//汇川电机型号数组
const Uint16 SIT_MotorModel[SIT_MotorModelNum] = {  
//编号          电机型号
//  0,          //ISMH1-50A30CB
    1,          //ISMH1-10B30CB
//  2,          //ISMH1-15B30CB
    3,          //ISMH1-20B30CB
    4,          //ISMH1-40B30CB
    5,          //ISMH1-55B30CB
    6,          //ISMH1-75B30CB
    7,          //ISMH1-10C30CB
    703,        //ISMH1-20B30CB-Z
    783,        //ISMH1-20B30CB-ZA
    704,        //ISMH1-40B30CB-Z
    784,        //ISMH1-40B30CB-ZA
    706,        //ISMH1-75B30CB-Z

    100,        //ISMH2-10C30CD
    101,        //ISMH2-15C30CD
    102,        //ISMH2-20C30CD
    103,        //ISMH2-25C30CD
    104,        //ISMH2-30C30CD
    105,        //ISMH2-40C30CD
    106,        //ISMH2-50C30CD
    150,        //ISMH2-10C30CB
    151,        //ISMH2-15C30CB
    155,        //ISMH2-40C30CB

    210,        //ISMH3-45B15CD
    211,        //ISMH3-85B15CD
    212,        //ISMH3-13C15CD
    213,        //ISMH3-18C15CD
    214,        //ISMH3-29C15CD
    215,        //ISMH3-44C15CD
    216,        //ISMH3-55C15CD
    217,        //ISMH3-75C15CD
    222,        //ISMH3-87B10CD
    223,        //ISMH3-12C10CD
    261,        //ISMH3-85B15CB
    262,        //ISMH3-13C15CB
    263,        //ISMH3-18C15CB
    272,        //ISMH3-87B10CB
    273,        //ISMH3-12C10CB

    600,        //ISMH4-40B30CB
    804,        //ISMH4-40B30CB-Z
    884,        //ISMH4-40B30CB-ZA
    806,        //ISMH4-75B30CB-Z

    714,        //ISMH3-29C15CD-z
    715,        //ISMH3-44C15CD-z
    716,        //ISMH3-55C15CD-z
    717,        //ISMH3-75C15CD-z

//  300,        //ISMV1-50A30CB
//  301,        //ISMV1-10B30CB
//  302,        //ISMV1-15B30CB
    303,        //ISMV1-20B30CB
    304,        //ISMV1-40B30CB
    305,        //ISMV1-55B30CB
    306,        //ISMV1-75B30CB
    307,        //ISMV1-10C30CB

    400,        //ISMV2-10C30CD
    401,        //ISMV2-15C30CD
    402,        //ISMV2-20C30CD
    403,        //ISMV2-25C30CD
    404,        //ISMV2-30C30CD
    405,        //ISMV2-40C30CD
    406,        //ISMV2-50C30CD

    510,        //ISMV3-45B15CD
    511,        //ISMV3-85B15CD
    512,        //ISMV3-13C15CD
    513,        //ISMV3-18C15CD
    514,        //ISMV3-29C15CD
    515,        //ISMV3-44C15CD
    516,        //ISMV3-55C15CD
    517,        //ISMV3-75C15CD
    521,        //ISMV3-18C15CB
};

//各个型号汇川电机参数结构体的地址
const STR_MOTRORPARA * SIT_MotorParaAddr[SIT_MotorModelNum] = {
    //地址                                                  电机型号    
//  (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[0],         //ISMH1-50A30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[0],         //ISMH1-10B30CB
//  (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[2],         //ISMH1-15B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[1],         //ISMH1-20B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[2],         //ISMH1-40B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[3],         //ISMH1-55B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[4],         //ISMH1-75B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[5],         //ISMH1-10C30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[6],         //ISMH1-20B30CB-Z
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[7],         //ISMH1-20B30CB-ZA
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[8],         //ISMH1-40B30CB-Z
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[9],         //ISMH1-40B30CB-ZA
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H1AV[10],         //ISMH1-75B30CB-Z

    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[0],         //ISMH2-10C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[1],         //ISMH2-15C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[2],         //ISMH2-20C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[3],         //ISMH2-25C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[4],         //ISMH2-30C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[5],         //ISMH2-40C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[6],         //ISMH2-50C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[7],         //ISMH2-10C30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[8],         //ISMH2-15C30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H2SV[9],         //ISMH2-40C30CB

    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[0],         //ISMH3-45B15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[1],         //ISMH3-85B15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[2],         //ISMH3-13C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[3],         //ISMH3-18C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[4],         //ISMH3-29C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[5],         //ISMH3-44C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[6],         //ISMH3-55C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[7],         //ISMH3-75C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[8],         //ISMH3-87B10CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[9],         //ISMH3-12C10CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[10],        //ISMH3-85B15CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[11],        //ISMH3-13C15CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[12],        //ISMH3-18C15CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[13],        //ISMH3-87B10CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3SV[14],        //ISMH3-12C10CB

    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H4SV[0],         //ISMH4-40B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H4SV[1],         //ISMH4-40B30CB-Z
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H4SV[2],         //ISMH4-40B30CB-ZA
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H4SV[3],         //ISMH4-75B30CB-Z

    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3ZSV[0],        //ISMH3-29c15cd-Z
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3ZSV[1],        //ISMH3-44c15cd-Z
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3ZSV[2],        //ISMH3-55c15cd-Z
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_H3ZSV[3],        //ISMH3-75c15cd-Z

//  (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[0],         //ISMV1-50A30CB
//  (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[1],         //ISMV1-10B30CB
//  (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[2],         //ISMV1-15B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[0],         //ISMV1-20B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[1],         //ISMV1-40B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[2],         //ISMV1-55B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[3],         //ISMV1-75B30CB
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V1SV[4],         //ISMV1-10C30CB

    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V2SV[0],         //ISMV2-10C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V2SV[1],         //ISMV2-15C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V2SV[2],         //ISMV2-20C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V2SV[3],         //ISMV2-25C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V2SV[4],         //ISMV2-30C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V2SV[5],         //ISMV2-40C30CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V2SV[6],         //ISMV2-50C30CD
                                                            
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[0],         //ISMV3-45B15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[1],         //ISMV3-85B15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[2],         //ISMV3-13C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[3],         //ISMV3-18C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[4],         //ISMV3-29C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[5],         //ISMV3-44C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[6],         //ISMV3-55C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[7],         //ISMV3-75C15CD
    (STR_MOTRORPARA *)&Motor_Parameter_SIT_V3SV[8],         //ISMV3-18C15CB
};



/* Exported_Functions --------------------------------------------------------*/
/* 可供其它文件调用的函数的声明 */
void DealMotorPara(void);

/* Private_Functions ---------------------------------------------------------*/
/* 该文件内部调用的函数的声明 */ 
Static_Inline void CopyMotorPara(const STR_MOTRORPARA *p);
Static_Inline void CopyLinearMotorPara(const STR_BLMOT_PARAM *p);

/*******************************************************************************
  函数名: 
  输入:   无 
  输出:   无 
  子函数: 无
    1.
    2.
********************************************************************************/
void DealMotorPara(void)
{
    Uint32  Counter = 0;

    if((FunCodeUnion.code.MT_MotorModel / 1000) < 10) //汇川电机
    {
        //校验电机型号
        for(Counter=0;Counter<SIT_MotorModelNum;Counter++)
        {
            if(FunCodeUnion.code.MT_MotorModel == SIT_MotorModel[Counter])
            {
                break;
            }
        }

        if(Counter >= SIT_MotorModelNum)
        {
            PostErrMsg(NULL_MOTOR);      //电机型号不存在 产品匹配故障
            return ;
        }
        //复制电机参数
        CopyMotorPara(SIT_MotorParaAddr[Counter]);
    }
    else  
    {
        switch(FunCodeUnion.code.MT_MotorModel)
        {
            case 10000:
                CopyMotorPara(&Motor_Parameter_SANYO_P5[0]);
                break;
            case 10001:
                CopyMotorPara(&Motor_Parameter_SANYO_P5[1]);
                break;
            case 10002:
                CopyMotorPara(&Motor_Parameter_SANYO_P5[2]);
                break;
            case 10100:
                CopyMotorPara(&Motor_Parameter_SANYO_P3[0]);
                break;
            case 10101:
                CopyMotorPara(&Motor_Parameter_SANYO_P3[1]);
                break;
            case 11000:
                CopyMotorPara(&Motor_Parameter_MECAPION_S0[0]);
                break;
            case 11001:
                CopyMotorPara(&Motor_Parameter_MECAPION_S0[1]);
                break;
            case 12000:
                CopyMotorPara(&Motor_Parameter_GOLDENAGE_S0[0]);
                break;
            case 13000:
                CopyLinearMotorPara(&Motor_Parameter_Linear[0]);
                break;
            default:
                PostErrMsg(NULL_MOTOR);       //电机型号不存在  产品匹配故障
                return ;
        }
    }
}

/*******************************************************************************
  函数名: 
  输入:   无 
  输出:   无 
  子函数: 无
    1.
    2.
********************************************************************************/
Static_Inline void CopyLinearMotorPara(const STR_BLMOT_PARAM *p)
{
    FunCodeUnion.code.MT_RsdMotorModel  = p->RsdMotorModel;      //H00_01 内部电机参数数组的唯一标识
    FunCodeUnion.code.MT_RateVolt       = p->RateVolt;           //H00_09 额定电压
    FunCodeUnion.code.MT_RatePower      = p->RatePower ;         //H00_10 额定功率
    FunCodeUnion.code.MT_RateCurrent    = p->RateCurrent;        //H00_11 连续电流
    FunCodeUnion.code.MT_RateToq        = p->RateForce;          //H00_12 连续推力
    FunCodeUnion.code.MT_MaxToqOrCur    = p->MaxCurrent;        //H00_13 最大电流
    FunCodeUnion.code.MT_RateSpd        = p->RateSpd;            //H00_14 额定转速
    FunCodeUnion.code.MT_MaxSpd         = p->MaxSpd;             //H00_15 最大转速
    FunCodeUnion.code.MT_Inertia        = p->MoverMass;          //H00_16 动子质量
    FunCodeUnion.code.MT_PolePair       = p->PolePair;           //H00_17 永磁同步电机极对数
    FunCodeUnion.code.MT_StatResist     = p->StatResist;         //H00_18 定子电阻
    FunCodeUnion.code.MT_StatInductQ    = p->StatInductQ;        //H00_19 定子电感Lq
    FunCodeUnion.code.MT_StatInductD    = p->StatInductD;        //H00_20 定子电感Ld
    FunCodeUnion.code.MT_RevEleCoe      = p->RevEleCoe;          //H00_21 反电势系数
    FunCodeUnion.code.MT_ToqCoe         = p->ToqCoe;             //H00_22 转矩系数
    FunCodeUnion.code.MT_EleConst       = p->EleConst;           //H00_23 电气常数
    FunCodeUnion.code.MT_MachConst      = p->MachConst;          //H00_24 电机常数
    FunCodeUnion.code.MT_EncoderSel     = p->EncoderSel;         //H00_30 编码器选择
    FunCodeUnion.code.MT_EncoderPensL   = p->PolarLength;       //H00_31 直线电机极距
    FunCodeUnion.code.MT_EncoderPensH   = p->EncoderRslt;       //H00_32 光栅尺分辨率
    FunCodeUnion.code.MT_InitTheta      = p->InitTheta;          //H00_33 初始电角度
    FunCodeUnion.code.MT_UposedgeTheta  = p->UposedgeTheta;      //H00_34 Uposedge角度 
    
    FunCodeUnion.code.OEM_KedGain       = p->KedGain;             //H01_22 D轴反电势补偿因子
    FunCodeUnion.code.OEM_KeqGain       = p->KeqGain;             //H01_23 Q轴反电势补偿因子
    FunCodeUnion.code.OEM_CurIdKpSec    = p->CurIdKpSec;          //H01_24 D轴电流环比例增益
    FunCodeUnion.code.OEM_CurIdKiSec    = p->CurIdKiSec;          //H01_25 D轴电流环积分补偿因子
    FunCodeUnion.code.OEM_CurIqKpSec    = p->CurIqKpSec;          //H01_27 Q轴电流环比例增益
    FunCodeUnion.code.OEM_CurIqKiSec    = p->CurIqKiSec;          //H01_28 Q轴电流环积分积分补偿因子
    FunCodeUnion.code.OEM_CapIdKp       = p->CapIdKp;             //H01_52 性能优先模式D轴比例增益
    FunCodeUnion.code.OEM_CapIdKi       = p->CapIdKi;             //H01_53 性能优先模式D轴积分补偿因子
    FunCodeUnion.code.OEM_CapIqKp       = p->CapIqKp;             //H01_54 性能优先模式Q轴比例增益
    FunCodeUnion.code.OEM_CapIqKi       = p->CapIqKi;             //H01_55 性能优先模式Q轴积分补偿因子       
}

/*******************************************************************************
  函数名: 
  输入:   无 
  输出:   无 
  子函数: 无
    1.
    2.
********************************************************************************/
Static_Inline void CopyMotorPara(const STR_MOTRORPARA *p)
{
    FunCodeUnion.code.MT_RsdMotorModel  = p->RsdMotorModel;      //H00_01 内部电机参数数组的唯一标识
    FunCodeUnion.code.MT_RateVolt       = p->RateVolt;           //H00_09 额定电压
    FunCodeUnion.code.MT_RatePower      = p->RatePower ;         //H00_10 额定功率
    FunCodeUnion.code.MT_RateCurrent    = p->RateCurrent;        //H00_11 额定电流
    FunCodeUnion.code.MT_RateToq        = p->RateToq;            //H00_12 额定转矩
    FunCodeUnion.code.MT_MaxToqOrCur    = p->MaxToq;        //H00_13 最大转矩
    FunCodeUnion.code.MT_RateSpd        = p->RateSpd;            //H00_14 额定转速
    FunCodeUnion.code.MT_MaxSpd         = p->MaxSpd;             //H00_15 最大转速
    FunCodeUnion.code.MT_Inertia        = p->Inertia;            //H00_16 转动惯量
    FunCodeUnion.code.MT_PolePair       = p->PolePair;           //H00_17 永磁同步电机极对数
    FunCodeUnion.code.MT_StatResist     = p->StatResist;         //H00_18 定子电阻
    FunCodeUnion.code.MT_StatInductQ    = p->StatInductQ;        //H00_19 定子电感Lq
    FunCodeUnion.code.MT_StatInductD    = p->StatInductD;        //H00_20 定子电感Ld
    FunCodeUnion.code.MT_RevEleCoe      = p->RevEleCoe;          //H00_21 反电势系数
    FunCodeUnion.code.MT_ToqCoe         = p->ToqCoe;             //H00_22 转矩系数
    FunCodeUnion.code.MT_EleConst       = p->EleConst;           //H00_23 电气常数
    FunCodeUnion.code.MT_MachConst      = p->MachConst;          //H00_24 机械常数
    FunCodeUnion.code.MT_EncoderSel     = p->EncoderSel;         //H00_30 编码器选择
    FunCodeUnion.code.MT_EncoderPensL   = p->EncoderPensL;       //H00_31 编码器线数 低
    FunCodeUnion.code.MT_EncoderPensH   = p->EncoderPensH;       //H00_32 编码器线数 高
    FunCodeUnion.code.MT_InitTheta      = p->InitTheta;          //H00_33 初始电角度
    FunCodeUnion.code.MT_UposedgeTheta  = p->UposedgeTheta;      //H00_34 Uposedge角度

    FunCodeUnion.code.OEM_KedGain       = p->KedGain;             //H01_22 D轴反电势补偿因子
    FunCodeUnion.code.OEM_KeqGain       = p->KeqGain;             //H01_23 Q轴反电势补偿因子
    FunCodeUnion.code.OEM_CurIdKpSec    = p->CurIdKpSec;          //H01_24 D轴电流环比例增益
    FunCodeUnion.code.OEM_CurIdKiSec    = p->CurIdKiSec;          //H01_25 D轴电流环积分补偿因子
    FunCodeUnion.code.OEM_CurIqKpSec    = p->CurIqKpSec;          //H01_27 Q轴电流环比例增益
    FunCodeUnion.code.OEM_CurIqKiSec    = p->CurIqKiSec;          //H01_28 Q轴电流环积分积分补偿因子
    FunCodeUnion.code.OEM_CapIdKp       = p->CapIdKp;             //H01_52 性能优先模式D轴比例增益
    FunCodeUnion.code.OEM_CapIdKi       = p->CapIdKi;             //H01_53 性能优先模式D轴积分补偿因子
    FunCodeUnion.code.OEM_CapIqKp       = p->CapIqKp;             //H01_54 性能优先模式Q轴比例增益
    FunCodeUnion.code.OEM_CapIqKi       = p->CapIqKi;             //H01_55 性能优先模式Q轴积分补偿因子
}

/********************************* END OF FILE *********************************/
