/*******************************************************************************
 深圳市汇川技术有限公司 版权所有（C）All rights reserved.                    
 文件名:    FUNC_DriverPara.c  
 创建人：   童文邹                 创建日期：2009.03.01                     
 修改人：   王治国                 修改日期：2011.11.22 
 描述： 
    1. 驱动器参数表 
    2. 
 修改记录：  
    2011.11.22  王治国
    1. 将驱动器参数表相关函数及宏定义整理在本文件及对应头文件中
    2. 不同平台的驱动器只要替换本文件就可以,无需更改FUNC_FunCode.c文件
********************************************************************************/ 

/* Includes ------------------------------------------------------------------*/
/* 引用头文件 */ 
#include "FUNC_GlobalVariable.h"
#include "FUNC_DriverPara.h"
#include "FUNC_FunCode.h"
#include "FUNC_FunCodeDefault.h" 
#include "FUNC_OperEeprom.h"
#include "FUNC_ManageFunCode.h"
#include "FUNC_ErrorCode.h"

/* Private_Constants ---------------------------------------------------------*/
/* 不带参数的宏定义 */
//三相/单相 220 00系列驱动器型号数量
#define DRIVER_NUMS_S0       8//增加PS017  PS026

//三相380 01系列驱动器型号数量        
#define DRIVER_NUMS_S1       7
 
//三相380 02系列驱动器型号数量       
#if POWERDRIVER_TYPE==POWDRV_IS650
#define DRIVER_NUMS_S2       22 
#endif       

//驱动器总和
#define DRIVER_SUM       (DRIVER_NUMS_S0 + DRIVER_NUMS_S1)

/* Private_Macros ------------------------------------------------------------*/
/* 带参数的宏定义 */  


/* Private_Variables ---------------------------------------------------------*/
/* 变量定义 */


/* Private_TypesDefinitions --------------------------------------------------*/ 
/* 结构体变量定义 枚举变量定义 */  
const STR_DRIVERPARA Driver_Parameter_S0[DRIVER_NUMS_S0] = 
{
    /* 0002 驱动器 */                                            
          2,       /*H01_02 伺服驱动系列号*/
        220,       /*H01_04 电压等级 */
         20,       /*H01_05 额定输出功率 */
         20,       /*H01_06 最大输出功率 */
        160,       /*H01_07 额定输出电流 */
        580,       /*H01_08 最大输出电流 */
          0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
       8000,       /*H01_10 载波频率 */
          1,       /*H01_11 电流环调制频率选择*/
          1,       /*H01_12 速度环调度分频系数*/
          4,       /*H01_13 位置环调度分频系数*/
        200,       /*H01_14 死区时间 0.01us  */
        420,       /*H01_15 母线过压保护点*/
        380,       /*H01_16 母线电压泄放点*/
        200,       /*H01_17 母线电压欠压点*/
        100,       /*H01_18 过流保护点 */
        200,        /*H01_20 死区补偿量 0.01us */
         50,       /*H02_21 驱动器允许的能耗电阻最小值*/
          3,       /*H02_25 能耗电阻设置 */
         40,       /*H02_22 内置能耗电阻功率容量 */
         50,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         703,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       1067,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A  */
        280,       //H01_62 U V相7860检测保护点 0.1%

    /* 0003 驱动器 */                                            
          3,        /*H01_02 伺服驱动系列号*/
        220,        /*H01_04 电压等级 */
         40,        /*H01_05 额定输出功率 */
         40,        /*H01_06 最大输出功率 */
        280,        /*H01_07 额定输出电流 */
       1010,        /*H01_08 最大输出电流 */
          0,        /*H01_09 Σ-Δ调制器外部时钟使能 */
       8000,       /*H01_10 载波频率 */
          1,       /*H01_11 电流环调制频率选择*/
          1,        /*H01_12 速度环调度分频系数*/
          4,       /*H01_13 位置环调度分频系数*/
        200,       /*H01_14 死区时间 0.01us  */
        420,       /*H01_15 母线过压保护点*/
        380,       /*H01_16 母线电压泄放点*/
        200,       /*H01_17 母线电压欠压点*/
        100,       /*H01_18 过流保护点 */
        200,       /*H01_20 死区补偿量 0.01us */
         45,       /*H02_21 驱动器允许的能耗电阻最小值*/
          3,       /*H02_25 能耗电阻设置 */
         40,       /*H02_22 内置能耗电阻功率容量 */
         50,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         704,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       2133,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

    /* 0005 驱动器 */                                            
           5,       /*H01_02 伺服驱动系列号*/
         220,       /*H01_04 电压等级 */
          75,       /*H01_05 额定输出功率 */
          75,       /*H01_06 最大输出功率 */
         550,       /*H01_07 额定输出电流 */
        1690,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        8000,      /*H01_10 载波频率 */
           1,      /*H01_11 电流环调制频率*/
           1,      /*H01_12 速度环调度分频系数*/
           4,      /*H01_13 位置环调度分频系数*/
         200,      /*H01_14 死区时间 0.01us  */
         420,      /*H01_15 母线过压保护点*/
         380,      /*H01_16 母线电压泄放点*/
         200,      /*H01_17 母线电压欠压点*/
         100,      /*H01_18 过流保护点 */
         200,      /*H01_20 死区补偿量 0.01us */
          40,      /*H02_21 驱动器允许的能耗电阻最小值*/
           0,      /*H02_25 能耗电阻设置 */
          50,      /*H02_22 内置能耗电阻功率容量 */
          50,      /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         706,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       3200,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

    /* 0006 驱动器 */                                            
           6,       /*H01_02 伺服驱动系列号*/
         220,       /*H01_04 电压等级 */
         100,       /*H01_05 额定输出功率 */
         100,       /*H01_06 最大输出功率 */
         760,       /*H01_07 额定输出电流 */
        1700,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        8000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           4,       /*H01_13 位置环调度分频系数*/
         200,       /*H01_14 死区时间 0.01us  */
         420,       /*H01_15 母线过压保护点*/
         380,       /*H01_16 母线电压泄放点*/
         200,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         200,       /*H01_20 死区补偿量 0.01us */
          20,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
          80,       /*H02_22 内置能耗电阻功率容量 */
          25,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         261,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
        5333,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

    /* 0007 驱动器  S012 开始默认配华大的电机 */   
         7,       /*H01_02 伺服驱动系列号*/
       220,       /*H01_04 电压等级 */
       150,       /*H01_05 额定输出功率 */
       150,       /*H01_06 最大输出功率 */
      1160,       /*H01_07 额定输出电流 */
      2800,       /*H01_08 最大输出电流 */
         0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
      8000,       /*H01_10 载波频率 */
         1,       /*H01_11 电流环调制频率选择*/
         1,       /*H01_12 速度环调度分频系数*/
         4,       /*H01_13 位置环调度分频系数*/
       200,       /*H01_14 死区时间 0.01us  */
       420,       /*H01_15 母线过压保护点*/
       380,       /*H01_16 母线电压泄放点*/
       200,       /*H01_17 母线电压欠压点*/
       100,       /*H01_18 过流保护点 */
       200,       /*H01_20 死区补偿量 0.01us */
        15,       /*H02_21 驱动器允许的能耗电阻最小值*/
         0,       /*H02_25 能耗电阻设置 */
        80,       /*H02_22 内置能耗电阻功率容量 */
        25,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         262,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
      6400,      /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

    /* 0008  S018 驱动器 */                                    
         8,       /*H01_02 伺服驱动系列号*/
       220,       /*H01_04 电压等级 */
       200,       /*H01_05 额定输出功率 */
       200,       /*H01_06 最大输出功率 */
      1850,       /*H01_07 额定输出电流 */
      4200,       /*H01_08 最大输出电流 */
         0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
      4000,       /*H01_10 载波频率 */
         1,       /*H01_11 电流环调制频率选择*/
         1,       /*H01_12 速度环调度分频系数*/
         2,       /*H01_13 位置环调度分频系数*/
       300,       /*H01_14 死区时间 us  */
       420,       /*H01_15 母线过压保护点*/
       380,       /*H01_16 母线电压泄放点*/
       200,       /*H01_17 母线电压欠压点*/
       100,       /*H01_18 过流保护点 */
       300,       /*H01_20 死区补偿量 us */
        15,       /*H02_21 驱动器允许的能耗电阻最小值*/
         0,       /*H02_25 能耗电阻设置 */
       100,       /*H02_22 内置能耗电阻功率容量 */
        40,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
     13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         263,       /*H00_00 默认电机型号 */
#else
     14000,       /*H00_00 默认电机型号 */
#endif
     10667,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

     /* 0009  S017-T017 驱动器 */                                            
           9,       /*H01_02 伺服驱动系列号*/
         220,       /*H01_04 电压等级 */
         500,       /*H01_05 额定输出功率 */
         500,       /*H01_06 最大输出功率 */
        1650,       /*H01_07 额定输出电流 */
        4200,       /*H01_08 最大输出电流 */
         0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        4000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           2,       /*H01_13 位置环调度分频系数*/
         300,       /*H01_14 死区时间 *25ns  */
         420,       /*H01_15 母线过压保护点*/
         380,       /*H01_16 母线电压泄放点*/
         200,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         300,       /*H01_20 死区补偿量 0.01us */
          35,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
         100,       /*H02_22 内置能耗电阻功率容量 */
          40,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         155,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       10667,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%


     /* 00010  S026-T026 驱动器 */                                            
       	  10,       /*H01_02 伺服驱动系列号*/
         220,       /*H01_04 电压等级 */
         750,       /*H01_05 额定输出功率 */
         750,       /*H01_06 最大输出功率 */
        2570,       /*H01_07 额定输出电流 */
        6500,       /*H01_08 最大输出电流 */
         0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        4000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           2,       /*H01_13 位置环调度分频系数*/
         300,       /*H01_14 死区时间 *25ns  */
         420,       /*H01_15 母线过压保护点*/
         380,       /*H01_16 母线电压泄放点*/
         200,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         300,       /*H01_20 死区补偿量 0.01us */
          25,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
         100,       /*H02_22 内置能耗电阻功率容量 */
          40,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         717,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       16000,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A  */
        280,       //H01_62 U V相7860检测保护点 0.1%
}; 

const STR_DRIVERPARA Driver_Parameter_S1[DRIVER_NUMS_S1] = 
{
     /* 10001 驱动器 */                                            
       10001,       /*H01_02 伺服驱动系列号*/
         380,       /*H01_04 电压等级 */
         100,       /*H01_05 额定输出功率 */
         100,       /*H01_06 最大输出功率 */
         350,       /*H01_07 额定输出电流 */
         850,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        8000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           4,       /*H01_13 位置环调度分频系数*/
         200,       /*H01_14 死区时间 *25ns  */
         760,       /*H01_15 母线过压保护点*/
         700,       /*H01_16 母线电压泄放点*/
         380,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         200,        /*H01_20 死区补偿量 0.01us */
          80,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
          80,       /*H02_22 内置能耗电阻功率容量 */
         100,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         211,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
        3200,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

     /* 10002 驱动器 */                                            
       10002,       /*H01_02 伺服驱动系列号*/
         380,       /*H01_04 电压等级 */
         150,       /*H01_05 额定输出功率 */
         150,       /*H01_06 最大输出功率 */
         540,       /*H01_07 额定输出电流 */
        1400,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        8000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           4,       /*H01_13 位置环调度分频系数*/
         200,        /*H01_14 死区时间 *25ns */
         760,       /*H01_15 母线过压保护点*/
         700,       /*H01_16 母线电压泄放点*/
         380,       /*H01_17 母线缪骨费沟?  */
         100,       /*H01_18 过流保护点 */
         200,        /*H01_20 死区补偿量 0.01us */
          60,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
          80,       /*H02_22 内置能耗电阻功率容量 */
         100,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         212,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
        3200,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A*/
        280,       //H01_62 U V相7860检测保护点 0.1%

     /* 10003 驱动器 */                                            
       10003,       /*H01_02 伺服驱动系列号*/
         380,       /*H01_04 电压等级 */
         200,       /*H01_05 额定输出功率 */
         200,       /*H01_06 最大输出功率 */
         840,       /*H01_07 额定输出电流 */
        2000,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        4000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           2,       /*H01_13 位置环调度分频系数*/
         300,       /*H01_14 死区时间 *25ns  */
         760,       /*H01_15 母线过压保护点*/
         700,       /*H01_16 母线电压泄放点*/
         380,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         300,        /*H01_20 死区补偿量 0.01us */
          45,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
          80,       /*H02_22 内置能耗电阻功率容量 */
          50,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         213,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
        5333,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

     /* 10004 驱动器 */                                            
       10004,       /*H01_02 伺服驱动系列号*/
         380,       /*H01_04 电压等级 */
         300,       /*H01_05 额定输出功率 */
         300,       /*H01_06 最大输出功率 */
        1190,       /*H01_07 额定输出电流 */
        2380,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        4000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           2,       /*H01_13 位置环调度分频系数*/
         300,       /*H01_14 死区时间 *25ns  */
         760,       /*H01_15 母线过压保护点*/
         700,       /*H01_16 母线电压泄放点*/
         380,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         300,        /*H01_20 死区补偿量 0.01us */
          40,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
          80,       /*H02_22 内置能耗电阻功率容量 */
          50,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         714,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
        6400,        /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

     /* 10005 驱动器 */                                            
       10005,       /*H01_02 伺服驱动系列号*/
         380,       /*H01_04 电压等级 */
         500,       /*H01_05 额定输出功率 */
         500,       /*H01_06 最大输出功率 */
        1650,       /*H01_07 额定输出电流 */
        4200,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        4000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           2,       /*H01_13 位置环调度分频系数*/
         300,       /*H01_14 死区时间 *25ns  */
         760,       /*H01_15 母线过压保护点*/
         700,       /*H01_16 母线电压泄放点*/
         380,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         300,       /*H01_20 死区补偿量 0.01us */
          35,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
         100,       /*H02_22 内置能耗电阻功率容量 */
          40,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         715,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       10667,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A */
        280,       //H01_62 U V相7860检测保护点 0.1%

        /* 10006 驱动器 */                                         
       10006,       /*H01_02 伺服驱动系列号*/
         380,       /*H01_04 电压等级 */
         600,       /*H01_05 额定输出功率 */
         600,       /*H01_06 最大输出功率 */
        2080,       /*H01_07 额定输出电流 */
        5500,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        4000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           2,       /*H01_13 位置环调度分频系数*/
         300,       /*H01_14 死区时间 *25ns  */
         760,       /*H01_15 母线过压保护点*/
         700,       /*H01_16 母线电压泄放点*/
         380,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         300,       /*H01_20 死区补偿量 0.01us */
          25,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
         100,       /*H02_22 内置能耗电阻功率容量 */
          40,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         716,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       10667,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A  */
        280,       //H01_62 U V相7860检测保护点 0.1%

        /* 10007 驱动器 */                                         
       10007,       /*H01_02 伺服驱动系列号*/
         380,       /*H01_04 电压等级 */
         750,       /*H01_05 额定输出功率 */
         750,       /*H01_06 最大输出功率 */
        2570,       /*H01_07 额定输出电流 */
        6500,       /*H01_08 最大输出电流 */
           0,       /*H01_09 Σ-Δ调制器外部时钟使能 */
        4000,       /*H01_10 载波频率 */
           1,       /*H01_11 电流环调制频率选择*/
           1,       /*H01_12 速度环调度分频系数*/
           2,       /*H01_13 位置环调度分频系数*/
         300,       /*H01_14 死区时间 *25ns  */
         760,       /*H01_15 母线过压保护点*/
         700,       /*H01_16 母线电压泄放点*/
         380,       /*H01_17 母线电压欠压点*/
         100,       /*H01_18 过流保护点 */
         300,       /*H01_20 死区补偿量 0.01us */
          25,       /*H02_21 驱动器允许的能耗电阻最小值*/
           0,       /*H02_25 能耗电阻设置 */
         100,       /*H02_22 内置能耗电阻功率容量 */
          40,       /*H02_23 内置能耗电阻阻值 */
#if NONSTANDARD_PROJECT == LINEARMOT
       13000,       /*H00_00 默认电机型号 */
#elif NONSTANDARD_PROJECT == IS600P
         717,       /*H00_00 默认电机型号 */
#else
       14000,       /*H00_00 默认电机型号 */
#endif
       16000,       /*H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A  */
        280,       //H01_62 U V相7860检测保护点 0.1%
};


#if POWERDRIVER_TYPE==POWDRV_IS650
const STR_DRIVERPARA Driver_Parameter_S2[DRIVER_NUMS_S2] = 
{
       //20000 T017驱动器                                             
       20000,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
         750,       //H01_05 额定输出功率                       
         750,       //H01_06 最大输出功率                       
        1700,       //H01_07 额定输出电流                       
        3179,       //H01_08 最大输出电流                       
           0,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          65,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        6400,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         424,        //H01_62 U V相7860检测保护点 0.1% 

       //20001 T025驱动器                                             
       20001,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        1100,       //H01_05 额定输出功率                       
        1100,       //H01_06 最大输出功率                       
        2500,       //H01_07 额定输出电流                       
        4675,       //H01_08 最大输出电流                       
           0,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          43,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        6400,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         391,        //H01_64 U V相7860检测保护点 0.1% 

       //20002 T032驱动器                                             
       20002,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        1200,       //H01_05 额定输出功率                       
        1200,       //H01_06 最大输出功率                       
        3200,       //H01_07 额定输出电流                       
        5984,       //H01_08 最大输出电流                       
           0,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          32,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        6400,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         424,        //H01_62 U V相7860检测保护点 0.1%

       //20003 T037驱动器                                             
       20003,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        1850,       //H01_05 额定输出功率                       
        1850,       //H01_06 最大输出功率                       
        3700,       //H01_07 额定输出电流                       
        6919,       //H01_08 最大输出电流                       
           0,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          25,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        6400,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         424,        //H01_62 U V相7860检测保护点 0.1% 

       //20004 T045驱动器                                             
       20004,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        2200,       //H01_05 额定输出功率                       
        2200,       //H01_06 最大输出功率                       
        4500,       //H01_07 额定输出电流                       
        8415,       //H01_08 最大输出电流                       
           0,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          20,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        6400,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         424,        //H01_62 U V相7860检测保护点 0.1%

       //20005 T060驱动器                                           
       20005,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        3000,       //H01_05 额定输出功率                       
        3000,       //H01_06 最大输出功率                       
        6000,       //H01_07 额定输出电流                       
       11220,       //H01_08 最大输出电流                       
           0,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          16,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        8000,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         424,        //H01_62 U V相7860检测保护点 0.1%

       //20006 T075驱动器                                           
       20006,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        3700,       //H01_05 额定输出功率                       
        3700,       //H01_06 最大输出功率                       
        7500,       //H01_07 额定输出电流                       
       14025,       //H01_08 最大输出电流                       
           0,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          13,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        8000,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         424,        //H01_62 U V相7860检测保护点 0.1%

       //20007 T075驱动器                                           
       20007,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        4500,       //H01_05 额定输出功率                       
        4500,       //H01_06 最大输出功率                       
        9100,       //H01_07 额定输出电流                       
       17017,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
          13,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        3860,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         933,        //H01_62 U V相7860检测保护点 0.1%

       //20008 T075驱动器                                           
       20008,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        5500,       //H01_05 额定输出功率                       
        5500,       //H01_06 最大输出功率                       
       11200,       //H01_07 额定输出电流                       
       20944,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        4751,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20009     ????                                           
       20009,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        7500,       //H01_05 额定输出功率                       
        7500,       //H01_06 最大输出功率                       
       12000,       //H01_07 额定输出电流                       
       22440,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        6330,       //电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20010 T176驱动器                                           
       20010,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        9000,       //H01_05 额定输出功率                       
        9000,       //H01_06 最大输出功率                       
       14000,       //H01_07 额定输出电流                       
       26180,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         780,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           3,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        7427,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,       //H01_62 U V相7860检测保护点 0.1%

       //20011,         //T210                                          
       20011,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
       11000,       //H01_05 额定输出功率                       
       11000,       //H01_06 最大输出功率                       
       17000,       //H01_07 额定输出电流                       
       31790,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         780,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           3,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        8862,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20012,		   //T253                                          
       20012,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
       13200,       //H01_05 额定输出功率                       
       13200,       //H01_06 最大输出功率                       
       20000,       //H01_07 额定输出电流                       
       37400,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14020,       //H00_00 默认电机型号
#else
       14020,       //H00_00 默认电机型号                       
#endif
       10676,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%


       //20013,		   //T304                                           
       20013,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
       16000,       //H01_05 额定输出功率                       
       16000,       //H01_06 最大输出功率                       
       24000,       //H01_07 额定输出电流                       
       44880,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14020,       //H00_00 默认电机型号
#else
       14020,       //H00_00 默认电机型号                       
#endif
       12829,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20014 T377驱动器                                           
       20014,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        20000,       //H01_05 额定输出功率                       
        20000,       //H01_06 最大输出功率                       
       29000,       //H01_07 额定输出电流                       
       54230,       //H01_08 最大输出电流         //由于最大电流溢出了16位 目前把单位转换为       0.1a   为704.9a      
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         780,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           3,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
        15909,       //电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,       //H01_64 U V相7860检测保护点 0.1%

       //20015 T426 驱动器                                           
       20015,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        22000,       //H01_05 额定输出功率                       
        22000,       //H01_06 最大输出功率                       
       33600,       //H01_07 额定输出电流                       
       62832,       //H01_08 最大输出电流       //由于最大电流溢出了16位 目前把单位转换为       0.1a        796.6 A                
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         780,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           3,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14000,       //H00_00 默认电机型号
#else
       14000,       //H00_00 默认电机型号                       
#endif
       17977,       //电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,       //H01_64 U V相7860检测保护点 0.1%


       //20016,		   //T465                                           
       20016,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        5500,       //H01_05 额定输出功率                       
        5500,       //H01_06 最大输出功率                       
       11200,       //H01_07 额定输出电流                       
       20944,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       65535,       //H00_00 默认电机型号
#else
       65535,       //H00_00 默认电机型号                       
#endif
        4751,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20017,		   //T520                                          
       20017,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        5500,       //H01_05 额定输出功率                       
        5500,       //H01_06 最大输出功率                       
       11200,       //H01_07 额定输出电流                       
       20944,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14020,       //H00_00 默认电机型号
#else
       14020,       //H00_00 默认电机型号                       
#endif
        4751,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20018,		   //T585                                           
       20018,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        5500,       //H01_05 额定输出功率                       
        5500,       //H01_06 最大输出功率                       
       11200,       //H01_07 额定输出电流                       
       20944,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14020,       //H00_00 默认电机型号
#else
       14020,       //H00_00 默认电机型号                       
#endif
        4751,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20019,		   //T650                                           
       20019,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        5500,       //H01_05 额定输出功率                       
        5500,       //H01_06 最大输出功率                       
       11200,       //H01_07 额定输出电流                       
       20944,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14020,       //H00_00 默认电机型号
#else
       14020,       //H00_00 默认电机型号                       
#endif
        4751,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20020     T725                                           
       20020,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        5500,       //H01_05 额定输出功率                       
        5500,       //H01_06 最大输出功率                       
       11200,       //H01_07 额定输出电流                       
       20944,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14020,       //H00_00 默认电机型号
#else
       14020,       //H00_00 默认电机型号                       
#endif
        4751,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

       //20021      T820                                           
       20021,       //H01_02 伺服驱动系列号                     
         380,       //H01_04 电压等级                           
        5500,       //H01_05 额定输出功率                       
        5500,       //H01_06 最大输出功率                       
       11200,       //H01_07 额定输出电流                       
       20944,       //H01_08 最大输出电流                       
           1,       //H01_09 Σ-Δ调制器外部时钟使能                           
        4000,       //H01_10 载波频率                           
           1,       //H01_11 电流环调制频率选择                    
           1,       //H01_12 速度环调度分频系数                     
           2,       //H01_13 位置环调度分频系数                     
         300,       //H01_14 死区时间 *25ns  
         780,       //H01_15 母线过压保护点                     
         700,       //H01_16 母线电压泄放点                     
         380,       //H01_17 母线电压欠压点                     
         100,       //H01_18 过流保护点                         
         300,       //H01_20 死区补偿量 0.01us                       
           8,       //H02_21 驱动器允许的能耗电阻最小值         
           1,       //H02_25 能耗电阻设置                       
          80,       //H02_22 内置能耗电阻功率容量                   
         100,       //H02_23 内置能耗电阻阻值                       
#if NONSTANDARD_PROJECT == STANDARD
       14020,       //H00_00 默认电机型号
#else
       14020,       //H00_00 默认电机型号                       
#endif
        4751,       //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A                           
         932,        //H01_62 U V相7860检测保护点 0.1%

};
#endif

//汇川驱动器型号数组
#if POWERDRIVER_TYPE==POWDRV_IS650
const Uint16 ServoSeri[DRIVER_NUMS_S2] = {
	20000,         //T017
	20001,         //T025
	20002,         //T032
	20003,         //T037
	20004,         //T045
	20005,         //T060
	20006,         //T075
	20007,         //T091
	20008,         //T112 
	20009,         //T150 
	20010,         //T176 
	20011,         //T210
	20012,		   //T253
	20013,		   //T304
	20014,		   //T377
	20015,		   //T426
	20016,		   //T465
	20017,		   //T520
	20018,		   //T585
	20019,		   //T650
	20020,		   //T725
	20021,		   //T820
};
//各个型号汇川驱动器参数结构体的地址
const STR_DRIVERPARA * DrvParaAddr[DRIVER_NUMS_S2] = {
    (STR_DRIVERPARA *)&Driver_Parameter_S2[0],         //T026
    (STR_DRIVERPARA *)&Driver_Parameter_S2[1],         //T025
    (STR_DRIVERPARA *)&Driver_Parameter_S2[2],         //T032
    (STR_DRIVERPARA *)&Driver_Parameter_S2[3],         //T037
    (STR_DRIVERPARA *)&Driver_Parameter_S2[4],         //T045
    (STR_DRIVERPARA *)&Driver_Parameter_S2[5],         //T060
    (STR_DRIVERPARA *)&Driver_Parameter_S2[6],         //T075
    (STR_DRIVERPARA *)&Driver_Parameter_S2[7],         //T091
    (STR_DRIVERPARA *)&Driver_Parameter_S2[8],         //T112
    (STR_DRIVERPARA *)&Driver_Parameter_S2[9],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[10],        //T176
    (STR_DRIVERPARA *)&Driver_Parameter_S2[11],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[12],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[13],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[14],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[15],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[16],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[17],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[18],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[19],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[20],         //
    (STR_DRIVERPARA *)&Driver_Parameter_S2[21],         //
};
#else
const Uint16 ServoSeri[DRIVER_SUM] = {
    2,         //S1R6
    3,         //S2R8
    5,         //S5R5
    6,         //S7R6
    7,         //S012
    8,         //S018
    9,         //S017-T017
    10,        //S026-T026
    10001,         //T3R5
    10002,         //T5R4
    10003,         //T8R4
    10004,         //T012
    10005,         //T017
    10006,         //T021
    10007,         //T026 
}; 

//各个型号汇川驱动器参数结构体的地址
const STR_DRIVERPARA * DrvParaAddr[DRIVER_SUM] = {
    (STR_DRIVERPARA *)&Driver_Parameter_S0[0],         //S1R6
    (STR_DRIVERPARA *)&Driver_Parameter_S0[1],         //S2R8
    (STR_DRIVERPARA *)&Driver_Parameter_S0[2],         //S5R5
    (STR_DRIVERPARA *)&Driver_Parameter_S0[3],         //S7R6
    (STR_DRIVERPARA *)&Driver_Parameter_S0[4],         //S012
    (STR_DRIVERPARA *)&Driver_Parameter_S0[5],         //S018
    (STR_DRIVERPARA *)&Driver_Parameter_S0[6],         //S017-T017
    (STR_DRIVERPARA *)&Driver_Parameter_S0[7],         //S026-T026
    (STR_DRIVERPARA *)&Driver_Parameter_S1[0],         //T3R5
    (STR_DRIVERPARA *)&Driver_Parameter_S1[1],         //T5R4
    (STR_DRIVERPARA *)&Driver_Parameter_S1[2],         //T8R4
    (STR_DRIVERPARA *)&Driver_Parameter_S1[3],         //T012
    (STR_DRIVERPARA *)&Driver_Parameter_S1[4],         //T017
    (STR_DRIVERPARA *)&Driver_Parameter_S1[5],         //T021
    (STR_DRIVERPARA *)&Driver_Parameter_S1[6],         //T026
};
#endif
/* Exported_Functions --------------------------------------------------------*/
/* 可供其它文件调用的函数的声明 */
void DealDriverPara(void);

/* Private_Functions ---------------------------------------------------------*/
/* 该文件内部调用的函数的声明 */ 
Static_Inline void CopyDriverPara(const STR_DRIVERPARA *p);

/*******************************************************************************
  函数名: 
  输入:   无 
  输出:   无 
  子函数: 无
    1.
    2.
********************************************************************************/
void DealDriverPara(void)
{
    Uint32  Counter = 0;

    //校验驱动器型号
#if POWERDRIVER_TYPE==POWDRV_IS650
	for(Counter=0;Counter<DRIVER_NUMS_S2;Counter++)
#else
    for(Counter=0;Counter<DRIVER_SUM;Counter++)
#endif   
    {
        if(FunCodeUnion.code.OEM_ServoSeri == ServoSeri[Counter])
        {
            break;
        }
    }

#if POWERDRIVER_TYPE==POWDRV_IS650
    if(Counter >= DRIVER_NUMS_S2)
#else
    if(Counter >= DRIVER_SUM)
#endif 

    {
        PostErrMsg(NULL_DRIVER);      //产品匹配故障
        return ;
    }

    //复制驱动器参数
    CopyDriverPara(DrvParaAddr[Counter]);
}


/*******************************************************************************
  函数名: 
  输入:   无 
  输出:   无 
  子函数: 无
    1.
    2.
********************************************************************************/
Static_Inline void CopyDriverPara(const STR_DRIVERPARA *p)
{
    FunCodeUnion.code.OEM_RsdServoSeri          = p->RsdServoSeri;            //H01_03 保留的用于比较的驱动器型号
    FunCodeUnion.code.OEM_VoltClass             = p->VoltClass;               //H01_04 电压级
    FunCodeUnion.code.OEM_RatePower             = p->RatePower;               //H01_05 额定功率
    FunCodeUnion.code.OEM_MaxPowerOut           = p->MaxPowerOut;             //H01_06 最大输出功率
    FunCodeUnion.code.OEM_RateCurrent           = p->RateCurrent;             //H01_07 驱动器额定输出电流
    FunCodeUnion.code.OEM_MaxCurrentOut         = p->MaxCurrentOut;           //H01_08 驱动器最大输出电流
    FunCodeUnion.code.OEM_SdmClkEnbl            = p->SdmClkEnbl;              //H01_09 Σ-Δ调制器外部时钟使能
    FunCodeUnion.code.OEM_CarrWaveFreq          = p->CarrWaveFreq;            //H01_10 载波频率
    FunCodeUnion.code.OEM_ToqLoopFreqSel        = p->ToqLoopFreqSel;          //H01_11 电流环调制频率选择
    FunCodeUnion.code.OEM_SpdLoopFreqScal       = p->SpdLoopFreqScal;         //H01_12 速度环调度分频系数
    FunCodeUnion.code.OEM_PosLoopFreqScal       = p->PosLoopFreqScal;         //H01_13 位置环调度分频系数
    FunCodeUnion.code.OEM_PwmDeadT              = p->PwmDeadT;                //H01_14 死区时间
    FunCodeUnion.code.OEM_UdcOver               = p->UdcOver;                 //H01_15 直流母线过压保护点
    FunCodeUnion.code.OEM_UdcLeak               = p->UdcLeak;                 //H01_16 直流母线电压泄放点
    FunCodeUnion.code.OEM_UdcLow                = p->UdcLow;                  //H01_17 直流母线电压欠压点
    FunCodeUnion.code.OEM_OCProtectPoint        = p->OCProtectPoint;          //H01_18 驱动器过流保护点
    FunCodeUnion.code.IS_7860Gain               = p->IS7860Gain;              //H01_19 电流采样最大量程 单位IS620:0.01A; IS650:0.1A
    FunCodeUnion.code.OEM_DeadComp              = p->DeadComp;                //H01_20 死区补偿时间
    FunCodeUnion.code.BP_RBMinOhm               = p->RBMinOhm;                //H02_21 驱动器允许的能耗电阻最小值
    FunCodeUnion.code.BP_RBPSizeI               = p->RBPSizeI;                //H02_22 内置能耗电阻功率容量
    FunCodeUnion.code.BP_RBOhmI                 = p->RBOhmI;                  //H02_23 内置能耗电阻阻值
    FunCodeUnion.code.BP_RBChoice               = p->RBChoice;                //H02_25 能耗电阻设置 
    FunCodeUnion.code.BP_RBPSizeO               = p->RBPSizeI;                //H02_26 外置能耗电阻功率容量
    FunCodeUnion.code.BP_RBOhmO                 = p->RBOhmI;                  //H02_27 外置能耗电阻阻值
    FunCodeUnion.code.MT_MotorModel             = p->MotorModel;              //H00_00 默认电机型号
    FunCodeUnion.code.OEM_OvrCurUV              = p->OvrCurUV;                //H01_62 U V相7860检测保护点 
}

/********************************* END OF FILE *********************************/
