/*******************************************************************************
 深圳市汇川技术有限公司 版权所有（C）All rights reserved.                    
 文件名:    MTR_AbsEncAngleInit.h  
 创建人：   姚虹                   创建日期：2012.04.02
 修改人：   王治国                 修改日期：2012.06.28
 描述： 
    1.
    2.
 修改记录：  
    XXXX.XX.XX  XXXXXXX
    1.
    2.
********************************************************************************/ 
#ifndef __MTR_ABSENCANGLEINIT_H
#define __MTR_ABSENCANGLEINIT_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* 引用头文件 */
#include "PUB_GlobalPrototypes.h"

/* Exported_Constants --------------------------------------------------------*/
/* 不带参数的宏定义 */


/* Exported_Macros -----------------------------------------------------------*/
/* 带参数的宏定义 */

/* Exported_Types ------------------------------------------------------------*/ 
/* 结构体变量类型定义 枚举变量类型定义 */ 



/* Exported_Variables --------------------------------------------------------*/
/* 可供其它文件调用变量的声明 */


/* Exported_Functions --------------------------------------------------------*/
/* 可供其它文件调用的函数的声明 */ 
extern void SerialCommEncAngleInit(void);         //H0D03绝对式编码器电角度初始化,在转矩中断函数调用

#ifdef __cplusplus
}
#endif

#endif /* __MTR_ABSENCANGLEINIT_H */

/********************************* END OF FILE *********************************/
