/*******************************************************************************
 深圳市汇川技术有限公司 版权所有（C）All rights reserved.                    
 文件名:    XX.c                                                           
 创建人：XX                创建日期：XX.XX.XX 
 修改人：XX                修改日期：XX.XX.XX 
 修改人：XX                修改日期：XX.XX.XX 
 描述： 
    1.
    2.
/-------------------------------------------------------------/
代码守则(2014年12月)
一 . 嵌套不能超过4层
二． 函数不能超过150行
三． 指针使用前必须有明确值
四． 变量名无二义、见名知义、不能与全局变量同名
五． 子函数名必须体现函数功能
六． 条件判断式和计算表达式中类型不一致量必须强制类型转换
七． 禁止用魔幻数字
八． 全局变量的增减必须评审
九． 条件判断中禁止用非’!’
十． 编译后不能有警告
********************************************************************************/

/* Includes ------------------------------------------------------------------*/
/* 引用头文件 */ 
#include "MTR_FPGAInterface.h" 
#include "MTR_GlobalVariable.h"
#include "MTR_InterfaceProcess.h" 



/* Private_Constants ---------------------------------------------------------*/
/* 不带参数的宏定义*/
//暂无

/* Private_Macros ------------------------------------------------------------*/
/* 带参数的宏定义 */
//暂无

/* Private_TypesDefinitions --------------------------------------------------*/ 
/* 结构体变量定义 枚举变量定义 */  
extern volatile UNI_FPGA_PERIODCTRL_REG  UNI_FPGA_PeriodCtrl;     //速度启动延时及同步设置寄存器


/* Private_Variables ---------------------------------------------------------*/
/* 变量定义 */		 

extern volatile Uint16 *SpeedStartDelay;    //速度计算启动延时
extern volatile Uint16 *SysState;           //系统状态
extern volatile Uint16 *EcatSyncState;	    //Ecat同步状态
extern volatile Uint16 *PWMPrd_Mode;
extern volatile Uint16 *SyncLengthL;   //SYNC0周期测量值
extern volatile Uint16 *SyncLengthH;   //SYNC0周期测量值
/* Exported_Functions --------------------------------------------------------*/
/* 可供其它文件调用的函数的声明 */ 	 
//暂无

/* Private_Functions ---------------------------------------------------------*/
/* 该文件内部调用的函数的声明 */ 
//暂无


/*******************************************************************************
  函数名:  
  输入:    
  输出:    
  子函数:         
  描述:  
********************************************************************************/
void SetEthercatSyncMode(void)
{
    UNI_FPGA_PeriodCtrl.bit.SyncMode = 0;  //初始化完成后设置为0，Ethercat同步            
    *SpeedStartDelay = UNI_FPGA_PeriodCtrl.all;  
}
/*******************************************************************************
  函数名:  
  输入:    
  输出:    
  子函数:         
  描述:  
********************************************************************************/
void SetSelfSyncMode(void)
{
    UNI_FPGA_PeriodCtrl.bit.SyncMode = 1;             
    *SpeedStartDelay = UNI_FPGA_PeriodCtrl.all;  
}

/*******************************************************************************
  函数名:  
  输入:    
  输出:    
  子函数:         
  描述:  
********************************************************************************/
void InitPeriodCtrlReg(void)
{
	UNI_FPGA_PeriodCtrl.bit.SyncEdge		= 0;  //总线同步信号的下降沿有效
    SetSelfSyncMode();             //初始启动时设置为1，自启动，初始化完成后设置为0，Ethercat同步
}



/*******************************************************************************
  函数名:  
  输入:    
  输出:    
  子函数:         
  描述:   单位25ns
********************************************************************************/
Uint16 GetSyncPeriod(void)
{
	return (0x7FFF & (*EcatSyncState));
}

/*******************************************************************************
  函数名:  
  输入:    
  输出:    
  子函数:         
  描述:  
********************************************************************************/
Uint8 GetEcatActive(void)
{
    if(0 == (0x8000 & (*EcatSyncState))) return 0;
    else return 1;
}

/*******************************************************************************
  函数名:  
  输入:    
  输出:    
  子函数:         
  描述:  
********************************************************************************/
void CompensatePwmPeriod(int8 CompVal)
{
    int16 Temp = 0;

    Temp = (int16)STR_MTR_Gvar.FPGA.PWMPrdMode.bit.PwmPeriod + (int16)CompVal; 

    if(1 == STR_MTR_Gvar.FPGA.PWMPrdMode.bit.PwmMode) 
    {
        *PWMPrd_Mode = (1 << 15) + Temp;
    }
    else
    {
        *PWMPrd_Mode = Temp;    
    }
}


/*******************************************************************************
  函数名:  
  输入:    
  输出:    
  子函数:         
  描述:    单位12.5ns
********************************************************************************/
int32 GetSyncLength(void)
{
    Uint32 Temp = 0;

    Temp = *SyncLengthH;
    Temp = (Temp << 16) | (*SyncLengthL);

    return ((int32)Temp);
}


/********************************* END OF FILE *********************************/
